python-cheatsheet.org
#+title: Python Cheat Sheet
#+author: Manos Vasilakis (advizor.gr)

* Comments.
#+BEGIN_SRC python
# Single line comments

""" Multiline comment
    can be written like
    this and can be as
    ....

           ....

                   ....
    long as you need it
    to be.
"""
#+END_SRC

* Primitive Datatypes and Operators
** Numbers
#+BEGIN_SRC python
3    # => 3    => integer
3.14 # => 3.14 => float
#+END_SRC

** Basic Math
#+BEGIN_SRC python
1 + 1   # => 2
8 - 1   # => 7
10 * 2  # => 20
35 / 5  # => 7.0
#+END_SRC

** Integer division
#+BEGIN_SRC python
5 // 3       # => 1
5.0 // 3.0   # => 1.0 # works on floats too
-5 // 3      # => -2
-5.0 // 3.0  # => -2.0
#+END_SRC

** Division's result is always a float
#+BEGIN_SRC python
10.0 / 3  # => 3.3333333333333335
#+END_SRC

** Modulo Operation
#+BEGIN_SRC python
7 % 3  # => 1
#+END_SRC

** Exponentiation
(x**y, x to the yth power)
#+BEGIN_SRC python
2**3  # => 8
#+END_SRC

** Enforce precedence
#+BEGIN_SRC python
(1 + 3) * 2  # => 8
#+END_SRC

** Boolean values are primitives
(Note: the capitalization)
#+BEGIN_SRC python
True
False
#+END_SRC

** Negate with not
#+BEGIN_SRC python
not True   # => False
not False  # => True
#+END_SRC

** Boolean Operators
Note "and" and "or" are case-sensitive
#+BEGIN_SRC python
True and False  # => False
False or True   # => True
#+END_SRC

** True and False are actually 1 and 0
#+BEGIN_SRC python
True + True # => 2
True * 8    # => 8
False - 5   # => -5
#+END_SRC

** Comparison operators
#+BEGIN_SRC python
0 == False  # => True
1 == True   # => True
2 == True   # => False
-5 != False # => True
#+END_SRC

