html/python-cheatsheet.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-16 Thu 22:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python Cheat Sheet</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Manos Vasilakis (advizor.gr)" />
<link rel="stylesheet" type="text/css" href="./css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Python Cheat Sheet</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org82d2de0">1. Comments.</a></li>
<li><a href="#org5b82194">2. Primitive Datatypes and Operators</a>
<ul>
<li><a href="#orgbd16467">2.1. Numbers</a></li>
<li><a href="#orgcd91c9a">2.2. Basic Math</a></li>
<li><a href="#orgcf40daf">2.3. Integer division</a></li>
<li><a href="#org483bf80">2.4. Division's result is always a float</a></li>
<li><a href="#orgcc8b42c">2.5. Modulo Operation</a></li>
<li><a href="#org90cb410">2.6. Exponentiation</a></li>
<li><a href="#org6f97180">2.7. Enforce precedence</a></li>
<li><a href="#org2fa693f">2.8. Boolean values are primitives</a></li>
<li><a href="#org8fbda4a">2.9. Negate with not</a></li>
<li><a href="#org91b48ef">2.10. Boolean Operators</a></li>
<li><a href="#orgf2036be">2.11. True and False are actually 1 and 0</a></li>
<li><a href="#org0585b2b">2.12. Comparison operators</a></li>
<li><a href="#orgbf88878">2.13. Using boolean logical operators on ints</a></li>
<li><a href="#orgdaf4662">2.14. Equality is ==</a></li>
<li><a href="#org8cf4907">2.15. Inequality is !=</a></li>
<li><a href="#org4ba185a">2.16. More comparisons</a></li>
<li><a href="#org18c1fac">2.17. Is value in range?</a>
<ul>
<li><a href="#orgce4bde9">2.17.1. Chaining makes this look nicer</a></li>
</ul>
</li>
<li><a href="#org9df6ccf">2.18. is VS. <code>==</code></a></li>
<li><a href="#org8b0c279">2.19. Strings are created with " or '</a></li>
<li><a href="#orgeca72bd">2.20. Strings can be added too!</a></li>
<li><a href="#org2ed1c71">2.21. Concatenate strings without using '+'</a></li>
<li><a href="#org7f46507">2.22. A string ~ list of chars</a></li>
<li><a href="#org03b2c76">2.23. Length of a string</a></li>
<li><a href="#org52011a6">2.24. Format strings with .format</a></li>
<li><a href="#org44ef300">2.25. Repeat the formatting arguments to save some typing.</a></li>
<li><a href="#org0b66615">2.26. Use keywords if you don't want to count.</a></li>
<li><a href="#org1f3e152">2.27. The old style of formatting:</a></li>
<li><a href="#org80831f0">2.28. Format using f-strings or formatted string literals (in Python 3.6+)</a></li>
<li><a href="#org7672e92">2.29. None is an object</a></li>
<li><a href="#org4379e71">2.30. Don't use the equality "==" symbol to compare objects to None</a></li>
<li><a href="#org66fc14d">2.31. None, 0, and empty strings/lists/dicts/tuples</a></li>
</ul>
</li>
<li><a href="#orgd30a68e">3. Variables and Collections</a>
<ul>
<li><a href="#org2a8e975">3.1. The print function</a>
<ul>
<li><a href="#org05251e2">3.1.1. Default newline at the end.</a></li>
</ul>
</li>
<li><a href="#org976f776">3.2. The input function</a></li>
<li><a href="#org8c6e0e7">3.3. Only assignments, No declarations.</a></li>
<li><a href="#org1649b79">3.4. Accessing Unassigned variable</a></li>
<li><a href="#org4593d24">3.5. Ternary operator</a></li>
<li><a href="#orgc57346a">3.6. Lists (~arraylike)</a>
<ul>
<li><a href="#org9b26571">3.6.1. Pre-filled list</a></li>
<li><a href="#orga230b7b">3.6.2. append - Add to the end</a></li>
<li><a href="#orgff900cb">3.6.3. pop - Remove from the end</a></li>
<li><a href="#org2710c34">3.6.4. Access list element</a></li>
<li><a href="#org7a5cad4">3.6.5. Last element</a></li>
<li><a href="#orgd0d8445">3.6.6. Out of bounds is an IndexError</a></li>
<li><a href="#orgf87b953">3.6.7. Ranges with slice syntax.</a></li>
<li><a href="#orgf0cbe3c">3.6.8. Closed/open range</a></li>
<li><a href="#org0c31b4d">3.6.9. Omit the beginning and return the list</a></li>
<li><a href="#org6c705cc">3.6.10. Omit the end and return the list</a></li>
<li><a href="#org0e9c17a">3.6.11. Select every second entry</a></li>
<li><a href="#org93111d6">3.6.12. Return a reversed copy</a></li>
<li><a href="#orgd59c05b">3.6.13. Advanced Slice Syntax</a></li>
<li><a href="#org0e993f3">3.6.14. Copy list</a></li>
<li><a href="#orgf8b1308">3.6.15. del - Remove arbitrary elements</a></li>
<li><a href="#orge4a8324">3.6.16. Remove first occurrence of a value</a></li>
<li><a href="#orgeeba8bb">3.6.17. Insert element at specific index</a></li>
<li><a href="#org79e40ec">3.6.18. Get the index of the first item found match</a></li>
<li><a href="#orga95b9c1">3.6.19. Add lists</a></li>
<li><a href="#org2cadfc5">3.6.20. extend - Concatenate lists</a></li>
<li><a href="#org9f46974">3.6.21. in - Check for existence</a></li>
<li><a href="#org8e11d4b">3.6.22. len - Length of list</a></li>
</ul>
</li>
<li><a href="#org0ff9e29">3.7. Tuples (~immutable lists).</a>
<ul>
<li><a href="#orgdd4dad2">3.7.1. length</a></li>
<li><a href="#org1b2b15c">3.7.2. Operations</a></li>
<li><a href="#orgd833e96">3.7.3. Unpack tuples</a></li>
<li><a href="#org6abb853">3.7.4. Extended unpacking</a></li>
<li><a href="#org9176bdd">3.7.5. Tuples by default</a></li>
<li><a href="#org7257984">3.7.6. Swap 2 values</a></li>
</ul>
</li>
<li><a href="#org8b76876">3.8. Dictionaries (~key-value pairs)</a>
<ul>
<li><a href="#orgaa88686">3.8.1. Prefilled dictionary</a></li>
<li><a href="#orgc852d66">3.8.2. Immutable types</a></li>
<li><a href="#orga21b2f6">3.8.3. Look up values with []</a></li>
<li><a href="#org72279bc">3.8.4. keys() - Get all keys</a></li>
<li><a href="#orgc3e6b5a">3.8.5. values() - Get all values</a></li>
<li><a href="#org8388657">3.8.6. in - Check for existence of keys</a></li>
<li><a href="#orgd2eefc9">3.8.7. Non-existing key is a KeyError</a></li>
<li><a href="#orga9f1c35">3.8.8. setdefault()</a></li>
<li><a href="#org9ec28c4">3.8.9. Adding to a dictionary</a></li>
<li><a href="#orgfb24b8a">3.8.10. del - Remove keys</a></li>
<li><a href="#orgec4b075">3.8.11. Additional unpacking options</a></li>
</ul>
</li>
<li><a href="#orgba59fd2">3.9. Sets (~unique elements)</a>
<ul>
<li><a href="#org1490fc0">3.9.1. Initialize a set with values.</a></li>
<li><a href="#org2b95caf">3.9.2. The elements of a set have to be immutable.</a></li>
<li><a href="#org2e8ffcf">3.9.3. Add item to the set</a></li>
<li><a href="#org2e1b352">3.9.4. None duplicate elements</a></li>
<li><a href="#org4054ee7">3.9.5. Set intersection with &amp;</a></li>
<li><a href="#org40fc252">3.9.6. Set union with |</a></li>
<li><a href="#orge3c34f8">3.9.7. Set difference with -</a></li>
<li><a href="#org52c4185">3.9.8. Set symmetric difference with ^</a></li>
<li><a href="#orgc4a7905">3.9.9. Set Superset</a></li>
<li><a href="#org341d52d">3.9.10. Set Subset</a></li>
<li><a href="#orgd3c168d">3.9.11. in - Check for existence</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org79bf2df">4. Control Flow and Iterables</a>
<ul>
<li><a href="#orgceffe24">4.1. If statement</a></li>
<li><a href="#org208229e">4.2. For loop</a>
<ul>
<li><a href="#orge1f3d16">4.2.1. range</a></li>
</ul>
</li>
<li><a href="#org177fda0">4.3. While loop</a></li>
<li><a href="#orgb6eda34">4.4. try/except - Handle exceptions</a></li>
<li><a href="#org3993878">4.5. Iterables</a></li>
</ul>
</li>
<li><a href="#orga3c9b13">5. Functions</a>
<ul>
<li><a href="#orgbcc9705">5.1. def - Create new functions</a></li>
<li><a href="#orgf3f9699">5.2. Calling functions with parameters</a></li>
<li><a href="#org0f89e1e">5.3. Another way to call functions</a></li>
<li><a href="#org3720db0">5.4. Arguments</a>
<ul>
<li><a href="#org04ace81">5.4.1. Variable number of positional arguments</a></li>
<li><a href="#orgdb2017b">5.4.2. Variable number of keyword arguments</a></li>
<li><a href="#orgaaac3bd">5.4.3. Both at once</a></li>
<li><a href="#org66321ae">5.4.4. Shorthand</a></li>
</ul>
</li>
<li><a href="#orgb7cd2b8">5.5. Returning multiple values</a></li>
<li><a href="#orgccb56b4">5.6. Function Scope</a></li>
<li><a href="#org44882c0">5.7. First class functions</a></li>
<li><a href="#org1dddda8">5.8. Anonymous functions</a></li>
<li><a href="#org03e4c2f">5.9. Built-in higher order funcs</a></li>
<li><a href="#org0853e8b">5.10. List comprehensions</a></li>
<li><a href="#org995ecf1">5.11. Dict comprehensions</a></li>
</ul>
</li>
<li><a href="#org82a1f8c">6. Modules</a>
<ul>
<li><a href="#orge1d88c6">6.1. import - Import module</a></li>
<li><a href="#org670f1ec">6.2. Get specific func from module</a></li>
<li><a href="#orgc9a7d5b">6.3. Import all funcs from module.</a></li>
<li><a href="#orgd37d432">6.4. Shorten module names</a></li>
<li><a href="#orgc5d24f0">6.5. Find which functions and attributes are defined in a module.</a></li>
</ul>
</li>
<li><a href="#org0a0db37">7. Classes</a>
<ul>
<li><a href="#org600a181">7.1. Basics</a></li>
<li><a href="#org8c52514">7.2. Inheritance</a>
<ul>
<li><a href="#orgce1b29a">7.2.1. Inherit from the Human class (superhero.py)</a></li>
</ul>
</li>
<li><a href="#org545e58c">7.3. Multiple Inheritance</a>
<ul>
<li><a href="#org2f1250e">7.3.1. Multiple Inheritance Example</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org12c9dbd">8. Advanced</a>
<ul>
<li><a href="#orga33ac09">8.1. Generators</a></li>
<li><a href="#org4204684">8.2. Decorators</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org82d2de0" class="outline-2">
<h2 id="org82d2de0"><span class="section-number-2">1</span> Comments.</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-python"># Single line comments

""" Multiline comment
    can be written like
    this and can be as
    ....

	   ....

		   ....
    long as you need it
    to be.
"""
</pre>
</div>
</div>
</div>

<div id="outline-container-org5b82194" class="outline-2">
<h2 id="org5b82194"><span class="section-number-2">2</span> Primitive Datatypes and Operators</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgbd16467" class="outline-3">
<h3 id="orgbd16467"><span class="section-number-3">2.1</span> Numbers</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-python">3    # =&gt; 3    =&gt; integer
3.14 # =&gt; 3.14 =&gt; float
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcd91c9a" class="outline-3">
<h3 id="orgcd91c9a"><span class="section-number-3">2.2</span> Basic Math</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-python">1 + 1   # =&gt; 2
8 - 1   # =&gt; 7
10 * 2  # =&gt; 20
35 / 5  # =&gt; 7.0
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcf40daf" class="outline-3">
<h3 id="orgcf40daf"><span class="section-number-3">2.3</span> Integer division</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-python">5 // 3       # =&gt; 1
5.0 // 3.0   # =&gt; 1.0 # works on floats too
-5 // 3      # =&gt; -2
-5.0 // 3.0  # =&gt; -2.0
</pre>
</div>
</div>
</div>

<div id="outline-container-org483bf80" class="outline-3">
<h3 id="org483bf80"><span class="section-number-3">2.4</span> Division's result is always a float</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-python">10.0 / 3  # =&gt; 3.3333333333333335
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcc8b42c" class="outline-3">
<h3 id="orgcc8b42c"><span class="section-number-3">2.5</span> Modulo Operation</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">
<pre class="src src-python">7 % 3  # =&gt; 1
</pre>
</div>
</div>
</div>

<div id="outline-container-org90cb410" class="outline-3">
<h3 id="org90cb410"><span class="section-number-3">2.6</span> Exponentiation</h3>
<div class="outline-text-3" id="text-2-6">
<p>
(x**y, x to the yth power)
</p>
<div class="org-src-container">
<pre class="src src-python">2**3  # =&gt; 8
</pre>
</div>
</div>
</div>

<div id="outline-container-org6f97180" class="outline-3">
<h3 id="org6f97180"><span class="section-number-3">2.7</span> Enforce precedence</h3>
<div class="outline-text-3" id="text-2-7">
<div class="org-src-container">
<pre class="src src-python">(1 + 3) * 2  # =&gt; 8
</pre>
</div>
</div>
</div>

<div id="outline-container-org2fa693f" class="outline-3">
<h3 id="org2fa693f"><span class="section-number-3">2.8</span> Boolean values are primitives</h3>
<div class="outline-text-3" id="text-2-8">
<p>
(Note: the capitalization)
</p>
<div class="org-src-container">
<pre class="src src-python">True
False
</pre>
</div>
</div>
</div>

<div id="outline-container-org8fbda4a" class="outline-3">
<h3 id="org8fbda4a"><span class="section-number-3">2.9</span> Negate with not</h3>
<div class="outline-text-3" id="text-2-9">
<div class="org-src-container">
<pre class="src src-python">not True   # =&gt; False
not False  # =&gt; True
</pre>
</div>
</div>
</div>

<div id="outline-container-org91b48ef" class="outline-3">
<h3 id="org91b48ef"><span class="section-number-3">2.10</span> Boolean Operators</h3>
<div class="outline-text-3" id="text-2-10">
<p>
Note "and" and "or" are case-sensitive
</p>
<div class="org-src-container">
<pre class="src src-python">True and False  # =&gt; False
False or True   # =&gt; True
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf2036be" class="outline-3">
<h3 id="orgf2036be"><span class="section-number-3">2.11</span> True and False are actually 1 and 0</h3>
<div class="outline-text-3" id="text-2-11">
<div class="org-src-container">
<pre class="src src-python">True + True # =&gt; 2
True * 8    # =&gt; 8
False - 5   # =&gt; -5
</pre>
</div>
</div>
</div>

<div id="outline-container-org0585b2b" class="outline-3">
<h3 id="org0585b2b"><span class="section-number-3">2.12</span> Comparison operators</h3>
<div class="outline-text-3" id="text-2-12">
<div class="org-src-container">
<pre class="src src-python">0 == False  # =&gt; True
1 == True   # =&gt; True
2 == True   # =&gt; False
-5 != False # =&gt; True
</pre>
</div>
</div>
</div>
