python-cheatsheet.org
** Using boolean logical operators on ints
Boolean logical operators on ints casts them to booleans for
evaluation, but their non-cast value is returned

Don't mix up with bool(ints) and bitwise and/or (&,|)

#+BEGIN_SRC python
bool(0)     # => False
bool(4)     # => True
bool(-6)    # => True
0 and 2     # => 0
-5 or 0     # => -5
#+END_SRC

** Equality is ==
#+BEGIN_SRC python
1 == 1  # => True
2 == 1  # => False
#+END_SRC

** Inequality is !=
#+BEGIN_SRC python
1 != 1  # => False
2 != 1  # => True
#+END_SRC

** More comparisons
#+BEGIN_SRC python
1 < 10  # => True
1 > 10  # => False
2 <= 2  # => True
2 >= 2  # => True
#+END_SRC

** Is value in range?
#+BEGIN_SRC python
1 < 2 and 2 < 3  # => True
2 < 3 and 3 < 2  # => False
#+END_SRC

*** Chaining makes this look nicer
#+BEGIN_SRC python
1 < 2 < 3  # => True
2 < 3 < 2  # => False
#+END_SRC

** is VS. ====
'is' checks if two variables refer to the same object, but == checks

If the objects pointed to have the same values.

#+BEGIN_SRC python
a = [1, 2, 3, 4]  # Point a at a new list, [1, 2, 3, 4]
b = a             # Point b at what a is pointing to
b is a            # => True, a and b refer to the same object
b == a            # => True, a's and b's objects are equal
b = [1, 2, 3, 4]  # Point b at a new list, [1, 2, 3, 4]
b is a            # => False, a and b do not refer to the same object
b == a            # => True, a's and b's objects are equal
#+END_SRC

** Strings are created with " or '
#+BEGIN_SRC python
"This is a string."
'This is also a string.'
#+END_SRC

** Strings can be added too!
#+BEGIN_SRC python
"Hello " + "world!"  # => "Hello world!"
#+END_SRC

** Concatenate strings without using '+'
#+BEGIN_SRC python
"Hello " "world!"    # => "Hello world!"
#+END_SRC

** A string ~ list of chars
#+BEGIN_SRC python
"This is a string"[0]  # => 'T'
#+END_SRC

** Length of a string
#+BEGIN_SRC python
len("This is a string")  # => 16
#+END_SRC

** Format strings with .format
#+BEGIN_SRC python
"{} can be {}".format("Strings", "interpolated")  # => "Strings can be interpolated"
#+END_SRC

** Repeat the formatting arguments to save some typing.
#+BEGIN_SRC python
"{0} be nimble, {0} be quick, {0} jump over the {1}".format("Jack", "candle stick")
# => "Jack be nimble, Jack be quick, Jack jump over the candle stick"
#+END_SRC

** Use keywords if you don't want to count.
#+BEGIN_SRC python
"{name} wants to eat {food}".format(name="Bob", food="lasagna")  # => "Bob wants to eat lasagna"
#+END_SRC

** The old style of formatting:
#+BEGIN_SRC python
"%s can be %s the %s way" % ("Strings", "interpolated", "old")  # => "Strings can be interpolated the old way"
#+END_SRC

** Format using f-strings or formatted string literals (in Python 3.6+)
#+BEGIN_SRC python
name = "Reiko"
f"She said her name is {name}." # => "She said her name is Reiko"
#+END_SRC

You can basically put any Python statement inside the braces and it will be output in the string.
#+BEGIN_SRC python
f"{name} is {len(name)} characters long."
#+END_SRC

** None is an object
#+BEGIN_SRC python
None  # => None
#+END_SRC

** Don't use the equality "==" symbol to compare objects to None
Use "is" instead. This checks for equality of object identity.

#+BEGIN_SRC python
"etc" is None  # => False
None is None   # => True
#+END_SRC

** None, 0, and empty strings/lists/dicts/tuples
None, 0, and empty strings/lists/dicts/tuples all evaluate to False.

All other values are True.
#+BEGIN_SRC python
bool(0)   # => False
bool("")  # => False
bool([])  # => False
bool({})  # => False
bool(())  # => False
#+END_SRC

* Variables and Collections
** The print function
#+BEGIN_SRC python
print("I'm Python. Nice to meet you!")  # => I'm Python. Nice to meet you!
#+END_SRC
*** Default newline at the end.
By default the print function also prints out a newline at the end.

Use the optional argument end to change the end string.
#+BEGIN_SRC python
print("Hello, World", end="!")  # => Hello, World!
#+END_SRC

** The input function
#+BEGIN_SRC python
input_string_var = input("Enter some data: ") # Returns the data as a string
#+END_SRC
Note: In earlier versions of Python, input() method was named as raw_input()

** Only assignments, No declarations.
Convention is to use lower_case_with_underscores
#+BEGIN_SRC python
some_var = 5
some_var  # => 5
#+END_SRC

** Accessing Unassigned variable
Accessing a previously unassigned variable is an exception.
See Control Flow to learn more about exception handling.
#+BEGIN_SRC python
some_unknown_var  # Raises a NameError
#+END_SRC

** Ternary operator
Equivalent of C's '?:' ternary operator
#+BEGIN_SRC python
"yahoo!" if 3 > 2 else 2  # => "yahoo!"
#+END_SRC

