html/python-cheatsheet.html

<div id="outline-container-orgbf88878" class="outline-3">
<h3 id="orgbf88878"><span class="section-number-3">2.13</span> Using boolean logical operators on ints</h3>
<div class="outline-text-3" id="text-2-13">
<p>
Boolean logical operators on ints casts them to booleans for
evaluation, but their non-cast value is returned
</p>

<p>
Don't mix up with bool(ints) and bitwise and/or (&amp;,|)
</p>

<div class="org-src-container">
<pre class="src src-python">bool(0)     # =&gt; False
bool(4)     # =&gt; True
bool(-6)    # =&gt; True
0 and 2     # =&gt; 0
-5 or 0     # =&gt; -5
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdaf4662" class="outline-3">
<h3 id="orgdaf4662"><span class="section-number-3">2.14</span> Equality is ==</h3>
<div class="outline-text-3" id="text-2-14">
<div class="org-src-container">
<pre class="src src-python">1 == 1  # =&gt; True
2 == 1  # =&gt; False
</pre>
</div>
</div>
</div>

<div id="outline-container-org8cf4907" class="outline-3">
<h3 id="org8cf4907"><span class="section-number-3">2.15</span> Inequality is !=</h3>
<div class="outline-text-3" id="text-2-15">
<div class="org-src-container">
<pre class="src src-python">1 != 1  # =&gt; False
2 != 1  # =&gt; True
</pre>
</div>
</div>
</div>

<div id="outline-container-org4ba185a" class="outline-3">
<h3 id="org4ba185a"><span class="section-number-3">2.16</span> More comparisons</h3>
<div class="outline-text-3" id="text-2-16">
<div class="org-src-container">
<pre class="src src-python">1 &lt; 10  # =&gt; True
1 &gt; 10  # =&gt; False
2 &lt;= 2  # =&gt; True
2 &gt;= 2  # =&gt; True
</pre>
</div>
</div>
</div>

<div id="outline-container-org18c1fac" class="outline-3">
<h3 id="org18c1fac"><span class="section-number-3">2.17</span> Is value in range?</h3>
<div class="outline-text-3" id="text-2-17">
<div class="org-src-container">
<pre class="src src-python">1 &lt; 2 and 2 &lt; 3  # =&gt; True
2 &lt; 3 and 3 &lt; 2  # =&gt; False
</pre>
</div>
</div>

<div id="outline-container-orgce4bde9" class="outline-4">
<h4 id="orgce4bde9"><span class="section-number-4">2.17.1</span> Chaining makes this look nicer</h4>
<div class="outline-text-4" id="text-2-17-1">
<div class="org-src-container">
<pre class="src src-python">1 &lt; 2 &lt; 3  # =&gt; True
2 &lt; 3 &lt; 2  # =&gt; False
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9df6ccf" class="outline-3">
<h3 id="org9df6ccf"><span class="section-number-3">2.18</span> is VS. <code>==</code></h3>
<div class="outline-text-3" id="text-2-18">
<p>
'is' checks if two variables refer to the same object, but == checks
</p>

<p>
If the objects pointed to have the same values.
</p>

<div class="org-src-container">
<pre class="src src-python">a = [1, 2, 3, 4]  # Point a at a new list, [1, 2, 3, 4]
b = a             # Point b at what a is pointing to
b is a            # =&gt; True, a and b refer to the same object
b == a            # =&gt; True, a's and b's objects are equal
b = [1, 2, 3, 4]  # Point b at a new list, [1, 2, 3, 4]
b is a            # =&gt; False, a and b do not refer to the same object
b == a            # =&gt; True, a's and b's objects are equal
</pre>
</div>
</div>
</div>

<div id="outline-container-org8b0c279" class="outline-3">
<h3 id="org8b0c279"><span class="section-number-3">2.19</span> Strings are created with " or '</h3>
<div class="outline-text-3" id="text-2-19">
<div class="org-src-container">
<pre class="src src-python">"This is a string."
'This is also a string.'
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeca72bd" class="outline-3">
<h3 id="orgeca72bd"><span class="section-number-3">2.20</span> Strings can be added too!</h3>
<div class="outline-text-3" id="text-2-20">
<div class="org-src-container">
<pre class="src src-python">"Hello " + "world!"  # =&gt; "Hello world!"
</pre>
</div>
</div>
</div>

<div id="outline-container-org2ed1c71" class="outline-3">
<h3 id="org2ed1c71"><span class="section-number-3">2.21</span> Concatenate strings without using '+'</h3>
<div class="outline-text-3" id="text-2-21">
<div class="org-src-container">
<pre class="src src-python">"Hello " "world!"    # =&gt; "Hello world!"
</pre>
</div>
</div>
</div>

<div id="outline-container-org7f46507" class="outline-3">
<h3 id="org7f46507"><span class="section-number-3">2.22</span> A string ~ list of chars</h3>
<div class="outline-text-3" id="text-2-22">
<div class="org-src-container">
<pre class="src src-python">"This is a string"[0]  # =&gt; 'T'
</pre>
</div>
</div>
</div>

<div id="outline-container-org03b2c76" class="outline-3">
<h3 id="org03b2c76"><span class="section-number-3">2.23</span> Length of a string</h3>
<div class="outline-text-3" id="text-2-23">
<div class="org-src-container">
<pre class="src src-python">len("This is a string")  # =&gt; 16
</pre>
</div>
</div>
</div>

<div id="outline-container-org52011a6" class="outline-3">
<h3 id="org52011a6"><span class="section-number-3">2.24</span> Format strings with .format</h3>
<div class="outline-text-3" id="text-2-24">
<div class="org-src-container">
<pre class="src src-python">"{} can be {}".format("Strings", "interpolated")  # =&gt; "Strings can be interpolated"
</pre>
</div>
</div>
</div>

<div id="outline-container-org44ef300" class="outline-3">
<h3 id="org44ef300"><span class="section-number-3">2.25</span> Repeat the formatting arguments to save some typing.</h3>
<div class="outline-text-3" id="text-2-25">
<div class="org-src-container">
<pre class="src src-python">"{0} be nimble, {0} be quick, {0} jump over the {1}".format("Jack", "candle stick")
# =&gt; "Jack be nimble, Jack be quick, Jack jump over the candle stick"
</pre>
</div>
</div>
</div>

<div id="outline-container-org0b66615" class="outline-3">
<h3 id="org0b66615"><span class="section-number-3">2.26</span> Use keywords if you don't want to count.</h3>
<div class="outline-text-3" id="text-2-26">
<div class="org-src-container">
<pre class="src src-python">"{name} wants to eat {food}".format(name="Bob", food="lasagna")  # =&gt; "Bob wants to eat lasagna"
</pre>
</div>
</div>
</div>

<div id="outline-container-org1f3e152" class="outline-3">
<h3 id="org1f3e152"><span class="section-number-3">2.27</span> The old style of formatting:</h3>
<div class="outline-text-3" id="text-2-27">
<div class="org-src-container">
<pre class="src src-python">"%s can be %s the %s way" % ("Strings", "interpolated", "old")  # =&gt; "Strings can be interpolated the old way"
</pre>
</div>
</div>
</div>

<div id="outline-container-org80831f0" class="outline-3">
<h3 id="org80831f0"><span class="section-number-3">2.28</span> Format using f-strings or formatted string literals (in Python 3.6+)</h3>
<div class="outline-text-3" id="text-2-28">
<div class="org-src-container">
<pre class="src src-python">name = "Reiko"
f"She said her name is {name}." # =&gt; "She said her name is Reiko"
</pre>
</div>

<p>
You can basically put any Python statement inside the braces and it will be output in the string.
</p>
<div class="org-src-container">
<pre class="src src-python">f"{name} is {len(name)} characters long."
</pre>
</div>
</div>
</div>

<div id="outline-container-org7672e92" class="outline-3">
<h3 id="org7672e92"><span class="section-number-3">2.29</span> None is an object</h3>
<div class="outline-text-3" id="text-2-29">
<div class="org-src-container">
<pre class="src src-python">None  # =&gt; None
</pre>
</div>
</div>
</div>

<div id="outline-container-org4379e71" class="outline-3">
<h3 id="org4379e71"><span class="section-number-3">2.30</span> Don't use the equality "==" symbol to compare objects to None</h3>
<div class="outline-text-3" id="text-2-30">
<p>
Use "is" instead. This checks for equality of object identity.
</p>

<div class="org-src-container">
<pre class="src src-python">"etc" is None  # =&gt; False
None is None   # =&gt; True
</pre>
</div>
</div>
</div>

<div id="outline-container-org66fc14d" class="outline-3">
<h3 id="org66fc14d"><span class="section-number-3">2.31</span> None, 0, and empty strings/lists/dicts/tuples</h3>
<div class="outline-text-3" id="text-2-31">
<p>
None, 0, and empty strings/lists/dicts/tuples all evaluate to False.
</p>

<p>
All other values are True.
</p>
<div class="org-src-container">
<pre class="src src-python">bool(0)   # =&gt; False
bool("")  # =&gt; False
bool([])  # =&gt; False
bool({})  # =&gt; False
bool(())  # =&gt; False
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd30a68e" class="outline-2">
<h2 id="orgd30a68e"><span class="section-number-2">3</span> Variables and Collections</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org2a8e975" class="outline-3">
<h3 id="org2a8e975"><span class="section-number-3">3.1</span> The print function</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-python">print("I'm Python. Nice to meet you!")  # =&gt; I'm Python. Nice to meet you!
</pre>
</div>
</div>
<div id="outline-container-org05251e2" class="outline-4">
<h4 id="org05251e2"><span class="section-number-4">3.1.1</span> Default newline at the end.</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
By default the print function also prints out a newline at the end.
</p>

<p>
Use the optional argument end to change the end string.
</p>
<div class="org-src-container">
<pre class="src src-python">print("Hello, World", end="!")  # =&gt; Hello, World!
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org976f776" class="outline-3">
<h3 id="org976f776"><span class="section-number-3">3.2</span> The input function</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-python">input_string_var = input("Enter some data: ") # Returns the data as a string
</pre>
</div>
<p>
Note: In earlier versions of Python, input() method was named as raw<sub>input</sub>()
</p>
</div>
</div>

<div id="outline-container-org8c6e0e7" class="outline-3">
<h3 id="org8c6e0e7"><span class="section-number-3">3.3</span> Only assignments, No declarations.</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Convention is to use lower<sub>case</sub><sub>with</sub><sub>underscores</sub>
</p>
<div class="org-src-container">
<pre class="src src-python">some_var = 5
some_var  # =&gt; 5
</pre>
</div>
</div>
</div>

<div id="outline-container-org1649b79" class="outline-3">
<h3 id="org1649b79"><span class="section-number-3">3.4</span> Accessing Unassigned variable</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Accessing a previously unassigned variable is an exception.
See Control Flow to learn more about exception handling.
</p>
<div class="org-src-container">
<pre class="src src-python">some_unknown_var  # Raises a NameError
</pre>
</div>
</div>
</div>

<div id="outline-container-org4593d24" class="outline-3">
<h3 id="org4593d24"><span class="section-number-3">3.5</span> Ternary operator</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Equivalent of C's '?:' ternary operator
</p>
<div class="org-src-container">
<pre class="src src-python">"yahoo!" if 3 &gt; 2 else 2  # =&gt; "yahoo!"
</pre>
</div>
</div>
</div>
