python-cheatsheet.org
** Lists (~arraylike)
#+BEGIN_SRC python
li = []
#+END_SRC
*** Pre-filled list
#+BEGIN_SRC python
other_li = [4, 5, 6]
#+END_SRC

*** append - Add to the end
#+BEGIN_SRC python
li.append(1)    # li is now [1]
li.append(2)    # li is now [1, 2]
li.append(4)    # li is now [1, 2, 4]
li.append(3)    # li is now [1, 2, 4, 3]
#+END_SRC
*** pop - Remove from the end
#+BEGIN_SRC python
li.pop()        # => 3 and li is now [1, 2, 4]
#+END_SRC
*** Access list element
#+BEGIN_SRC python
li[0]   # => 1
#+END_SRC
*** Last element
#+BEGIN_SRC python
li[-1]  # => 3
#+END_SRC

*** Out of bounds is an IndexError
#+BEGIN_SRC python
li[4]  # Raises an IndexError
#+END_SRC

*** Ranges with slice syntax.
The start index is included, the end index is not
*** Closed/open range
#+BEGIN_SRC python
li[1:3]   # => [2, 4]
#+END_SRC
*** Omit the beginning and return the list
#+BEGIN_SRC python
li[2:]    # => [4, 3]
#+END_SRC
*** Omit the end and return the list
#+BEGIN_SRC python
li[:3]    # => [1, 2, 4]
#+END_SRC
*** Select every second entry
#+BEGIN_SRC python
li[::2]   # =>[1, 4]
#+END_SRC
*** Return a reversed copy
#+BEGIN_SRC python
li[::-1]  # => [3, 4, 2, 1]
#+END_SRC
*** Advanced Slice Syntax
#+BEGIN_SRC python
li[start:end:step]
#+END_SRC

*** Copy list
#+BEGIN_SRC python
li2 = li[:]  # => li2 = [1, 2, 4, 3] but (li2 is li) will result in false.
#+END_SRC

*** del - Remove arbitrary elements
#+BEGIN_SRC python
del li[2]  # li is now [1, 2, 3]
#+END_SRC

*** Remove first occurrence of a value
#+BEGIN_SRC python
li.remove(2)  # li is now [1, 3]
li.remove(2)  # Raises a ValueError as 2 is not in the list
#+END_SRC

*** Insert element at specific index
#+BEGIN_SRC python
li.insert(1, 2)  # li is now [1, 2, 3] again
#+END_SRC

*** Get the index of the first item found match
#+BEGIN_SRC python
li.index(2)  # => 1
li.index(4)  # Raises a ValueError as 4 is not in the list
#+END_SRC

*** Add lists
Note: values for li and for other_li are not modified.
#+BEGIN_SRC python
li + other_li  # => [1, 2, 3, 4, 5, 6]
#+END_SRC

*** extend - Concatenate lists
#+BEGIN_SRC python
li.extend(other_li)  # Now li is [1, 2, 3, 4, 5, 6]
#+END_SRC

*** in - Check for existence
#+BEGIN_SRC python
1 in li  # => True
#+END_SRC

*** len - Length of list
#+BEGIN_SRC python
len(li)  # => 6
#+END_SRC

** Tuples (~immutable lists).
#+BEGIN_SRC python
tup = (1, 2, 3)
tup[0]      # => 1
tup[0] = 3  # Raises a TypeError
#+END_SRC

*** length
Note that a tuple of length one has to have a comma after the last element but tuples of other lengths, even zero, do not.
#+BEGIN_SRC python
type((1))   # => <class 'int'>
type((1,))  # => <class 'tuple'>
type(())    # => <class 'tuple'>
#+END_SRC

*** Operations
You can do most of the list operations on tuples too
#+BEGIN_SRC python
len(tup)         # => 3
tup + (4, 5, 6)  # => (1, 2, 3, 4, 5, 6)
tup[:2]          # => (1, 2)
2 in tup         # => True
#+END_SRC

*** Unpack tuples
You can unpack tuples (or lists) into variables
#+BEGIN_SRC python
a, b, c = (1, 2, 3)  # a is now 1, b is now 2 and c is now 3
#+END_SRC

*** Extended unpacking
You can also do extended unpacking
#+BEGIN_SRC python
a, *b, c = (1, 2, 3, 4)  # a is now 1, b is now [2, 3] and c is now 4
#+END_SRC

*** Tuples by default
Tuples are created by default if you leave out the parentheses
#+BEGIN_SRC python
d, e, f = 4, 5, 6  # tuple 4, 5, 6 is unpacked into variables d, e and f
# respectively such that d = 4, e = 5 and f = 6
#+END_SRC

*** Swap 2 values
Swap two values easily
#+BEGIN_SRC python
e, d = d, e  # d is now 5 and e is now 4
#+END_SRC

** Dictionaries (~key-value pairs)
#+BEGIN_SRC python
empty_dict = {}
#+END_SRC
*** Prefilled dictionary
#+BEGIN_SRC python
filled_dict = {"one": 1, "two": 2, "three": 3}
#+END_SRC

Note keys for dictionaries have to be immutable types. This is to ensure that
the key can be converted to a constant hash value for quick look-ups.

*** Immutable types
Immutable types include ints, floats, strings, tuples.
#+BEGIN_SRC python
invalid_dict = {[1,2,3]: "123"}  # => Raises a TypeError: unhashable type: 'list'
valid_dict = {(1,2,3):[1,2,3]}   # Values can be of any type, however.
#+END_SRC

