html/python-cheatsheet.html

<div id="outline-container-orgc57346a" class="outline-3">
<h3 id="orgc57346a"><span class="section-number-3">3.6</span> Lists (~arraylike)</h3>
<div class="outline-text-3" id="text-3-6">
<div class="org-src-container">
<pre class="src src-python">li = []
</pre>
</div>
</div>
<div id="outline-container-org9b26571" class="outline-4">
<h4 id="org9b26571"><span class="section-number-4">3.6.1</span> Pre-filled list</h4>
<div class="outline-text-4" id="text-3-6-1">
<div class="org-src-container">
<pre class="src src-python">other_li = [4, 5, 6]
</pre>
</div>
</div>
</div>

<div id="outline-container-orga230b7b" class="outline-4">
<h4 id="orga230b7b"><span class="section-number-4">3.6.2</span> append - Add to the end</h4>
<div class="outline-text-4" id="text-3-6-2">
<div class="org-src-container">
<pre class="src src-python">li.append(1)    # li is now [1]
li.append(2)    # li is now [1, 2]
li.append(4)    # li is now [1, 2, 4]
li.append(3)    # li is now [1, 2, 4, 3]
</pre>
</div>
</div>
</div>
<div id="outline-container-orgff900cb" class="outline-4">
<h4 id="orgff900cb"><span class="section-number-4">3.6.3</span> pop - Remove from the end</h4>
<div class="outline-text-4" id="text-3-6-3">
<div class="org-src-container">
<pre class="src src-python">li.pop()        # =&gt; 3 and li is now [1, 2, 4]
</pre>
</div>
</div>
</div>
<div id="outline-container-org2710c34" class="outline-4">
<h4 id="org2710c34"><span class="section-number-4">3.6.4</span> Access list element</h4>
<div class="outline-text-4" id="text-3-6-4">
<div class="org-src-container">
<pre class="src src-python">li[0]   # =&gt; 1
</pre>
</div>
</div>
</div>
<div id="outline-container-org7a5cad4" class="outline-4">
<h4 id="org7a5cad4"><span class="section-number-4">3.6.5</span> Last element</h4>
<div class="outline-text-4" id="text-3-6-5">
<div class="org-src-container">
<pre class="src src-python">li[-1]  # =&gt; 3
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd0d8445" class="outline-4">
<h4 id="orgd0d8445"><span class="section-number-4">3.6.6</span> Out of bounds is an IndexError</h4>
<div class="outline-text-4" id="text-3-6-6">
<div class="org-src-container">
<pre class="src src-python">li[4]  # Raises an IndexError
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf87b953" class="outline-4">
<h4 id="orgf87b953"><span class="section-number-4">3.6.7</span> Ranges with slice syntax.</h4>
<div class="outline-text-4" id="text-3-6-7">
<p>
The start index is included, the end index is not
</p>
</div>
</div>
<div id="outline-container-orgf0cbe3c" class="outline-4">
<h4 id="orgf0cbe3c"><span class="section-number-4">3.6.8</span> Closed/open range</h4>
<div class="outline-text-4" id="text-3-6-8">
<div class="org-src-container">
<pre class="src src-python">li[1:3]   # =&gt; [2, 4]
</pre>
</div>
</div>
</div>
<div id="outline-container-org0c31b4d" class="outline-4">
<h4 id="org0c31b4d"><span class="section-number-4">3.6.9</span> Omit the beginning and return the list</h4>
<div class="outline-text-4" id="text-3-6-9">
<div class="org-src-container">
<pre class="src src-python">li[2:]    # =&gt; [4, 3]
</pre>
</div>
</div>
</div>
<div id="outline-container-org6c705cc" class="outline-4">
<h4 id="org6c705cc"><span class="section-number-4">3.6.10</span> Omit the end and return the list</h4>
<div class="outline-text-4" id="text-3-6-10">
<div class="org-src-container">
<pre class="src src-python">li[:3]    # =&gt; [1, 2, 4]
</pre>
</div>
</div>
</div>
<div id="outline-container-org0e9c17a" class="outline-4">
<h4 id="org0e9c17a"><span class="section-number-4">3.6.11</span> Select every second entry</h4>
<div class="outline-text-4" id="text-3-6-11">
<div class="org-src-container">
<pre class="src src-python">li[::2]   # =&gt;[1, 4]
</pre>
</div>
</div>
</div>
<div id="outline-container-org93111d6" class="outline-4">
<h4 id="org93111d6"><span class="section-number-4">3.6.12</span> Return a reversed copy</h4>
<div class="outline-text-4" id="text-3-6-12">
<div class="org-src-container">
<pre class="src src-python">li[::-1]  # =&gt; [3, 4, 2, 1]
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd59c05b" class="outline-4">
<h4 id="orgd59c05b"><span class="section-number-4">3.6.13</span> Advanced Slice Syntax</h4>
<div class="outline-text-4" id="text-3-6-13">
<div class="org-src-container">
<pre class="src src-python">li[start:end:step]
</pre>
</div>
</div>
</div>

<div id="outline-container-org0e993f3" class="outline-4">
<h4 id="org0e993f3"><span class="section-number-4">3.6.14</span> Copy list</h4>
<div class="outline-text-4" id="text-3-6-14">
<div class="org-src-container">
<pre class="src src-python">li2 = li[:]  # =&gt; li2 = [1, 2, 4, 3] but (li2 is li) will result in false.
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf8b1308" class="outline-4">
<h4 id="orgf8b1308"><span class="section-number-4">3.6.15</span> del - Remove arbitrary elements</h4>
<div class="outline-text-4" id="text-3-6-15">
<div class="org-src-container">
<pre class="src src-python">del li[2]  # li is now [1, 2, 3]
</pre>
</div>
</div>
</div>

<div id="outline-container-orge4a8324" class="outline-4">
<h4 id="orge4a8324"><span class="section-number-4">3.6.16</span> Remove first occurrence of a value</h4>
<div class="outline-text-4" id="text-3-6-16">
<div class="org-src-container">
<pre class="src src-python">li.remove(2)  # li is now [1, 3]
li.remove(2)  # Raises a ValueError as 2 is not in the list
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeeba8bb" class="outline-4">
<h4 id="orgeeba8bb"><span class="section-number-4">3.6.17</span> Insert element at specific index</h4>
<div class="outline-text-4" id="text-3-6-17">
<div class="org-src-container">
<pre class="src src-python">li.insert(1, 2)  # li is now [1, 2, 3] again
</pre>
</div>
</div>
</div>

<div id="outline-container-org79e40ec" class="outline-4">
<h4 id="org79e40ec"><span class="section-number-4">3.6.18</span> Get the index of the first item found match</h4>
<div class="outline-text-4" id="text-3-6-18">
<div class="org-src-container">
<pre class="src src-python">li.index(2)  # =&gt; 1
li.index(4)  # Raises a ValueError as 4 is not in the list
</pre>
</div>
</div>
</div>

<div id="outline-container-orga95b9c1" class="outline-4">
<h4 id="orga95b9c1"><span class="section-number-4">3.6.19</span> Add lists</h4>
<div class="outline-text-4" id="text-3-6-19">
<p>
Note: values for li and for other<sub>li</sub> are not modified.
</p>
<div class="org-src-container">
<pre class="src src-python">li + other_li  # =&gt; [1, 2, 3, 4, 5, 6]
</pre>
</div>
</div>
</div>

<div id="outline-container-org2cadfc5" class="outline-4">
<h4 id="org2cadfc5"><span class="section-number-4">3.6.20</span> extend - Concatenate lists</h4>
<div class="outline-text-4" id="text-3-6-20">
<div class="org-src-container">
<pre class="src src-python">li.extend(other_li)  # Now li is [1, 2, 3, 4, 5, 6]
</pre>
</div>
</div>
</div>

<div id="outline-container-org9f46974" class="outline-4">
<h4 id="org9f46974"><span class="section-number-4">3.6.21</span> in - Check for existence</h4>
<div class="outline-text-4" id="text-3-6-21">
<div class="org-src-container">
<pre class="src src-python">1 in li  # =&gt; True
</pre>
</div>
</div>
</div>

<div id="outline-container-org8e11d4b" class="outline-4">
<h4 id="org8e11d4b"><span class="section-number-4">3.6.22</span> len - Length of list</h4>
<div class="outline-text-4" id="text-3-6-22">
<div class="org-src-container">
<pre class="src src-python">len(li)  # =&gt; 6
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0ff9e29" class="outline-3">
<h3 id="org0ff9e29"><span class="section-number-3">3.7</span> Tuples (~immutable lists).</h3>
<div class="outline-text-3" id="text-3-7">
<div class="org-src-container">
<pre class="src src-python">tup = (1, 2, 3)
tup[0]      # =&gt; 1
tup[0] = 3  # Raises a TypeError
</pre>
</div>
</div>

<div id="outline-container-orgdd4dad2" class="outline-4">
<h4 id="orgdd4dad2"><span class="section-number-4">3.7.1</span> length</h4>
<div class="outline-text-4" id="text-3-7-1">
<p>
Note that a tuple of length one has to have a comma after the last element but tuples of other lengths, even zero, do not.
</p>
<div class="org-src-container">
<pre class="src src-python">type((1))   # =&gt; &lt;class 'int'&gt;
type((1,))  # =&gt; &lt;class 'tuple'&gt;
type(())    # =&gt; &lt;class 'tuple'&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org1b2b15c" class="outline-4">
<h4 id="org1b2b15c"><span class="section-number-4">3.7.2</span> Operations</h4>
<div class="outline-text-4" id="text-3-7-2">
<p>
You can do most of the list operations on tuples too
</p>
<div class="org-src-container">
<pre class="src src-python">len(tup)         # =&gt; 3
tup + (4, 5, 6)  # =&gt; (1, 2, 3, 4, 5, 6)
tup[:2]          # =&gt; (1, 2)
2 in tup         # =&gt; True
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd833e96" class="outline-4">
<h4 id="orgd833e96"><span class="section-number-4">3.7.3</span> Unpack tuples</h4>
<div class="outline-text-4" id="text-3-7-3">
<p>
You can unpack tuples (or lists) into variables
</p>
<div class="org-src-container">
<pre class="src src-python">a, b, c = (1, 2, 3)  # a is now 1, b is now 2 and c is now 3
</pre>
</div>
</div>
</div>

<div id="outline-container-org6abb853" class="outline-4">
<h4 id="org6abb853"><span class="section-number-4">3.7.4</span> Extended unpacking</h4>
<div class="outline-text-4" id="text-3-7-4">
<p>
You can also do extended unpacking
</p>
<div class="org-src-container">
<pre class="src src-python">a, *b, c = (1, 2, 3, 4)  # a is now 1, b is now [2, 3] and c is now 4
</pre>
</div>
</div>
</div>

<div id="outline-container-org9176bdd" class="outline-4">
<h4 id="org9176bdd"><span class="section-number-4">3.7.5</span> Tuples by default</h4>
<div class="outline-text-4" id="text-3-7-5">
<p>
Tuples are created by default if you leave out the parentheses
</p>
<div class="org-src-container">
<pre class="src src-python">d, e, f = 4, 5, 6  # tuple 4, 5, 6 is unpacked into variables d, e and f
# respectively such that d = 4, e = 5 and f = 6
</pre>
</div>
</div>
</div>

<div id="outline-container-org7257984" class="outline-4">
<h4 id="org7257984"><span class="section-number-4">3.7.6</span> Swap 2 values</h4>
<div class="outline-text-4" id="text-3-7-6">
<p>
Swap two values easily
</p>
<div class="org-src-container">
<pre class="src src-python">e, d = d, e  # d is now 5 and e is now 4
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8b76876" class="outline-3">
<h3 id="org8b76876"><span class="section-number-3">3.8</span> Dictionaries (~key-value pairs)</h3>
<div class="outline-text-3" id="text-3-8">
<div class="org-src-container">
<pre class="src src-python">empty_dict = {}
</pre>
</div>
</div>
<div id="outline-container-orgaa88686" class="outline-4">
<h4 id="orgaa88686"><span class="section-number-4">3.8.1</span> Prefilled dictionary</h4>
<div class="outline-text-4" id="text-3-8-1">
<div class="org-src-container">
<pre class="src src-python">filled_dict = {"one": 1, "two": 2, "three": 3}
</pre>
</div>

<p>
Note keys for dictionaries have to be immutable types. This is to ensure that
the key can be converted to a constant hash value for quick look-ups.
</p>
</div>
</div>

<div id="outline-container-orgc852d66" class="outline-4">
<h4 id="orgc852d66"><span class="section-number-4">3.8.2</span> Immutable types</h4>
<div class="outline-text-4" id="text-3-8-2">
<p>
Immutable types include ints, floats, strings, tuples.
</p>
<div class="org-src-container">
<pre class="src src-python">invalid_dict = {[1,2,3]: "123"}  # =&gt; Raises a TypeError: unhashable type: 'list'
valid_dict = {(1,2,3):[1,2,3]}   # Values can be of any type, however.
</pre>
</div>
</div>
</div>
