python-cheatsheet.org
*** Look up values with []
#+BEGIN_SRC python
filled_dict["one"]  # => 1
#+END_SRC

*** keys() - Get all keys
Get all keys as an iterable with "keys()".
We need to wrap the call in list()
to turn it into a list. We'll talk about those later.  Note - Dictionary key
ordering is not guaranteed. Your results might not match this exactly.
#+BEGIN_SRC python
list(filled_dict.keys())  # => ["three", "two", "one"]
#+END_SRC

*** values() - Get all values
Get all values as an iterable.
Once again we need to wrap it
in list() to get it out of the iterable.

Note - Same as above regarding key ordering.

#+BEGIN_SRC python
list(filled_dict.values())  # => [3, 2, 1]
#+END_SRC

*** in - Check for existence of keys
#+BEGIN_SRC python
"one" in filled_dict  # => True
1 in filled_dict      # => False
#+END_SRC

*** Non-existing key is a KeyError
#+BEGIN_SRC python
filled_dict["four"]  # KeyError
#+END_SRC

**** Use "get()" to avoid the KeyError
#+BEGIN_SRC python
filled_dict.get("one")      # => 1
filled_dict.get("four")     # => None
#+END_SRC
***** The get method supports a default argument when the value is missing
#+BEGIN_SRC python
filled_dict.get("one", 4)   # => 1
filled_dict.get("four", 4)  # => 4
#+END_SRC

*** setdefault()
"setdefault()" inserts into a dictionary only if the given key isn't present.
#+BEGIN_SRC python
filled_dict.setdefault("five", 5)  # filled_dict["five"] is set to 5
filled_dict.setdefault("five", 6)  # filled_dict["five"] is still 5
#+END_SRC

*** Adding to a dictionary
#+BEGIN_SRC python
filled_dict.update({"four":4})  # => {"one": 1, "two": 2, "three": 3, "four": 4}
filled_dict["four"] = 4         # another way to add to dict
#+END_SRC

*** del - Remove keys
#+BEGIN_SRC python
del filled_dict["one"]  # Removes the key "one" from filled dict
#+END_SRC

*** Additional unpacking options
(Python >= 3.5)
#+BEGIN_SRC python
{'a': 1, **{'b': 2}}  # => {'a': 1, 'b': 2}
{'a': 1, **{'a': 2}}  # => {'a': 2}
#+END_SRC

** Sets (~unique elements)
#+BEGIN_SRC python
empty_set = set()
#+END_SRC
*** Initialize a set with values.
It looks a bit like a dict.
#+BEGIN_SRC python
some_set = {1, 1, 2, 2, 3, 4}  # some_set is now {1, 2, 3, 4}
#+END_SRC

*** The elements of a set have to be immutable.
Similar to keys of a dictionary, elements of a set have to be immutable.
#+BEGIN_SRC python
invalid_set = {[1], 1}  # => Raises a TypeError: unhashable type: 'list'
valid_set = {(1,), 1}
#+END_SRC

*** Add item to the set
#+BEGIN_SRC python
filled_set = some_set
filled_set.add(5)  # filled_set is now {1, 2, 3, 4, 5}
#+END_SRC

*** None duplicate elements
#+BEGIN_SRC python
filled_set.add(5)  # it remains as before {1, 2, 3, 4, 5}
#+END_SRC

*** Set intersection with &
#+BEGIN_SRC python
other_set = {3, 4, 5, 6}
filled_set & other_set  # => {3, 4, 5}
#+END_SRC

*** Set union with |
#+BEGIN_SRC python
filled_set | other_set  # => {1, 2, 3, 4, 5, 6}
#+END_SRC

*** Set difference with -
#+BEGIN_SRC python
{1, 2, 3, 4} - {2, 3, 5}  # => {1, 4}
#+END_SRC

*** Set symmetric difference with ^
#+BEGIN_SRC python
{1, 2, 3, 4} ^ {2, 3, 5}  # => {1, 4, 5}
#+END_SRC

*** Set Superset
Check if set on the left is a superset of set on the right
#+BEGIN_SRC python
{1, 2} >= {1, 2, 3} # => False
#+END_SRC

*** Set Subset
Check if set on the left is a subset of set on the right
#+BEGIN_SRC python
{1, 2} <= {1, 2, 3} # => True
#+END_SRC

*** in - Check for existence
#+BEGIN_SRC python
2 in filled_set   # => True
10 in filled_set  # => False
#+END_SRC

* Control Flow and Iterables
** If statement
Here is an if statement.

Indentation is significant in Python!
Convention is to use four spaces, not tabs.

This prints "some_var is smaller than 10"
#+BEGIN_SRC python
some_var = 5
if some_var > 10:
    print("some_var is totally bigger than 10.")
elif some_var < 10:    # This elif clause is optional.
    print("some_var is smaller than 10.")
else:                  # This is optional too.
    print("some_var is indeed 10.")
#+END_SRC

** For loop
For loops iterate over lists
#+BEGIN_EXAMPLE
prints:
    dog is a mammal
    cat is a mammal
    mouse is a mammal
#+END_EXAMPLE

#+BEGIN_SRC python
for animal in ["dog", "cat", "mouse"]:
    # You can use format() to interpolate formatted strings
    print("{} is a mammal".format(animal))
#+END_SRC
*** range
**** range(number)
Returns an iterable of numbers from zero to the given number
#+BEGIN_EXAMPLE
prints:
    0
    1
    2
    3
#+END_EXAMPLE
#+BEGIN_SRC python
for i in range(4):
    print(i)
#+END_SRC

**** range(lower, upper)
Returns an iterable of numbers
from the lower number to the upper number
#+BEGIN_EXAMPLE
prints:
    4
    5
    6
    7
#+END_EXAMPLE
#+BEGIN_SRC python
for i in range(4, 8):
    print(i)
#+END_SRC

