html/python-cheatsheet.html

<div id="outline-container-orga21b2f6" class="outline-4">
<h4 id="orga21b2f6"><span class="section-number-4">3.8.3</span> Look up values with []</h4>
<div class="outline-text-4" id="text-3-8-3">
<div class="org-src-container">
<pre class="src src-python">filled_dict["one"]  # =&gt; 1
</pre>
</div>
</div>
</div>

<div id="outline-container-org72279bc" class="outline-4">
<h4 id="org72279bc"><span class="section-number-4">3.8.4</span> keys() - Get all keys</h4>
<div class="outline-text-4" id="text-3-8-4">
<p>
Get all keys as an iterable with "keys()".
We need to wrap the call in list()
to turn it into a list. We'll talk about those later.  Note - Dictionary key
ordering is not guaranteed. Your results might not match this exactly.
</p>
<div class="org-src-container">
<pre class="src src-python">list(filled_dict.keys())  # =&gt; ["three", "two", "one"]
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc3e6b5a" class="outline-4">
<h4 id="orgc3e6b5a"><span class="section-number-4">3.8.5</span> values() - Get all values</h4>
<div class="outline-text-4" id="text-3-8-5">
<p>
Get all values as an iterable.
Once again we need to wrap it
in list() to get it out of the iterable.
</p>

<p>
Note - Same as above regarding key ordering.
</p>

<div class="org-src-container">
<pre class="src src-python">list(filled_dict.values())  # =&gt; [3, 2, 1]
</pre>
</div>
</div>
</div>

<div id="outline-container-org8388657" class="outline-4">
<h4 id="org8388657"><span class="section-number-4">3.8.6</span> in - Check for existence of keys</h4>
<div class="outline-text-4" id="text-3-8-6">
<div class="org-src-container">
<pre class="src src-python">"one" in filled_dict  # =&gt; True
1 in filled_dict      # =&gt; False
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd2eefc9" class="outline-4">
<h4 id="orgd2eefc9"><span class="section-number-4">3.8.7</span> Non-existing key is a KeyError</h4>
<div class="outline-text-4" id="text-3-8-7">
<div class="org-src-container">
<pre class="src src-python">filled_dict["four"]  # KeyError
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="org54ff0ef"></a>Use "get()" to avoid the KeyError<br />
<div class="outline-text-5" id="text-3-8-7-1">
<div class="org-src-container">
<pre class="src src-python">filled_dict.get("one")      # =&gt; 1
filled_dict.get("four")     # =&gt; None
</pre>
</div>
</div>
<ol class="org-ol">
<li><a id="org06a6a67"></a>The get method supports a default argument when the value is missing<br />
<div class="outline-text-6" id="text-3-8-7-1-1">
<div class="org-src-container">
<pre class="src src-python">filled_dict.get("one", 4)   # =&gt; 1
filled_dict.get("four", 4)  # =&gt; 4
</pre>
</div>
</div>
</li>
</ol>
</li>
</ol>
</div>

<div id="outline-container-orga9f1c35" class="outline-4">
<h4 id="orga9f1c35"><span class="section-number-4">3.8.8</span> setdefault()</h4>
<div class="outline-text-4" id="text-3-8-8">
<p>
"setdefault()" inserts into a dictionary only if the given key isn't present.
</p>
<div class="org-src-container">
<pre class="src src-python">filled_dict.setdefault("five", 5)  # filled_dict["five"] is set to 5
filled_dict.setdefault("five", 6)  # filled_dict["five"] is still 5
</pre>
</div>
</div>
</div>

<div id="outline-container-org9ec28c4" class="outline-4">
<h4 id="org9ec28c4"><span class="section-number-4">3.8.9</span> Adding to a dictionary</h4>
<div class="outline-text-4" id="text-3-8-9">
<div class="org-src-container">
<pre class="src src-python">filled_dict.update({"four":4})  # =&gt; {"one": 1, "two": 2, "three": 3, "four": 4}
filled_dict["four"] = 4         # another way to add to dict
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfb24b8a" class="outline-4">
<h4 id="orgfb24b8a"><span class="section-number-4">3.8.10</span> del - Remove keys</h4>
<div class="outline-text-4" id="text-3-8-10">
<div class="org-src-container">
<pre class="src src-python">del filled_dict["one"]  # Removes the key "one" from filled dict
</pre>
</div>
</div>
</div>

<div id="outline-container-orgec4b075" class="outline-4">
<h4 id="orgec4b075"><span class="section-number-4">3.8.11</span> Additional unpacking options</h4>
<div class="outline-text-4" id="text-3-8-11">
<p>
(Python &gt;= 3.5)
</p>
<div class="org-src-container">
<pre class="src src-python">{'a': 1, **{'b': 2}}  # =&gt; {'a': 1, 'b': 2}
{'a': 1, **{'a': 2}}  # =&gt; {'a': 2}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgba59fd2" class="outline-3">
<h3 id="orgba59fd2"><span class="section-number-3">3.9</span> Sets (~unique elements)</h3>
<div class="outline-text-3" id="text-3-9">
<div class="org-src-container">
<pre class="src src-python">empty_set = set()
</pre>
</div>
</div>
<div id="outline-container-org1490fc0" class="outline-4">
<h4 id="org1490fc0"><span class="section-number-4">3.9.1</span> Initialize a set with values.</h4>
<div class="outline-text-4" id="text-3-9-1">
<p>
It looks a bit like a dict.
</p>
<div class="org-src-container">
<pre class="src src-python">some_set = {1, 1, 2, 2, 3, 4}  # some_set is now {1, 2, 3, 4}
</pre>
</div>
</div>
</div>

<div id="outline-container-org2b95caf" class="outline-4">
<h4 id="org2b95caf"><span class="section-number-4">3.9.2</span> The elements of a set have to be immutable.</h4>
<div class="outline-text-4" id="text-3-9-2">
<p>
Similar to keys of a dictionary, elements of a set have to be immutable.
</p>
<div class="org-src-container">
<pre class="src src-python">invalid_set = {[1], 1}  # =&gt; Raises a TypeError: unhashable type: 'list'
valid_set = {(1,), 1}
</pre>
</div>
</div>
</div>

<div id="outline-container-org2e8ffcf" class="outline-4">
<h4 id="org2e8ffcf"><span class="section-number-4">3.9.3</span> Add item to the set</h4>
<div class="outline-text-4" id="text-3-9-3">
<div class="org-src-container">
<pre class="src src-python">filled_set = some_set
filled_set.add(5)  # filled_set is now {1, 2, 3, 4, 5}
</pre>
</div>
</div>
</div>

<div id="outline-container-org2e1b352" class="outline-4">
<h4 id="org2e1b352"><span class="section-number-4">3.9.4</span> None duplicate elements</h4>
<div class="outline-text-4" id="text-3-9-4">
<div class="org-src-container">
<pre class="src src-python">filled_set.add(5)  # it remains as before {1, 2, 3, 4, 5}
</pre>
</div>
</div>
</div>

<div id="outline-container-org4054ee7" class="outline-4">
<h4 id="org4054ee7"><span class="section-number-4">3.9.5</span> Set intersection with &amp;</h4>
<div class="outline-text-4" id="text-3-9-5">
<div class="org-src-container">
<pre class="src src-python">other_set = {3, 4, 5, 6}
filled_set &amp; other_set  # =&gt; {3, 4, 5}
</pre>
</div>
</div>
</div>

<div id="outline-container-org40fc252" class="outline-4">
<h4 id="org40fc252"><span class="section-number-4">3.9.6</span> Set union with |</h4>
<div class="outline-text-4" id="text-3-9-6">
<div class="org-src-container">
<pre class="src src-python">filled_set | other_set  # =&gt; {1, 2, 3, 4, 5, 6}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge3c34f8" class="outline-4">
<h4 id="orge3c34f8"><span class="section-number-4">3.9.7</span> Set difference with -</h4>
<div class="outline-text-4" id="text-3-9-7">
<div class="org-src-container">
<pre class="src src-python">{1, 2, 3, 4} - {2, 3, 5}  # =&gt; {1, 4}
</pre>
</div>
</div>
</div>

<div id="outline-container-org52c4185" class="outline-4">
<h4 id="org52c4185"><span class="section-number-4">3.9.8</span> Set symmetric difference with ^</h4>
<div class="outline-text-4" id="text-3-9-8">
<div class="org-src-container">
<pre class="src src-python">{1, 2, 3, 4} ^ {2, 3, 5}  # =&gt; {1, 4, 5}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc4a7905" class="outline-4">
<h4 id="orgc4a7905"><span class="section-number-4">3.9.9</span> Set Superset</h4>
<div class="outline-text-4" id="text-3-9-9">
<p>
Check if set on the left is a superset of set on the right
</p>
<div class="org-src-container">
<pre class="src src-python">{1, 2} &gt;= {1, 2, 3} # =&gt; False
</pre>
</div>
</div>
</div>

<div id="outline-container-org341d52d" class="outline-4">
<h4 id="org341d52d"><span class="section-number-4">3.9.10</span> Set Subset</h4>
<div class="outline-text-4" id="text-3-9-10">
<p>
Check if set on the left is a subset of set on the right
</p>
<div class="org-src-container">
<pre class="src src-python">{1, 2} &lt;= {1, 2, 3} # =&gt; True
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd3c168d" class="outline-4">
<h4 id="orgd3c168d"><span class="section-number-4">3.9.11</span> in - Check for existence</h4>
<div class="outline-text-4" id="text-3-9-11">
<div class="org-src-container">
<pre class="src src-python">2 in filled_set   # =&gt; True
10 in filled_set  # =&gt; False
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org79bf2df" class="outline-2">
<h2 id="org79bf2df"><span class="section-number-2">4</span> Control Flow and Iterables</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgceffe24" class="outline-3">
<h3 id="orgceffe24"><span class="section-number-3">4.1</span> If statement</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Here is an if statement.
</p>

<p>
Indentation is significant in Python!
Convention is to use four spaces, not tabs.
</p>

<p>
This prints "some<sub>var</sub> is smaller than 10"
</p>
<div class="org-src-container">
<pre class="src src-python">some_var = 5
if some_var &gt; 10:
    print("some_var is totally bigger than 10.")
elif some_var &lt; 10:    # This elif clause is optional.
    print("some_var is smaller than 10.")
else:                  # This is optional too.
    print("some_var is indeed 10.")
</pre>
</div>
</div>
</div>

<div id="outline-container-org208229e" class="outline-3">
<h3 id="org208229e"><span class="section-number-3">4.2</span> For loop</h3>
<div class="outline-text-3" id="text-4-2">
<p>
For loops iterate over lists
</p>
<pre class="example" id="org519a2ee">
prints:
    dog is a mammal
    cat is a mammal
    mouse is a mammal
</pre>

<div class="org-src-container">
<pre class="src src-python">for animal in ["dog", "cat", "mouse"]:
    # You can use format() to interpolate formatted strings
    print("{} is a mammal".format(animal))
</pre>
</div>
</div>
<div id="outline-container-orge1f3d16" class="outline-4">
<h4 id="orge1f3d16"><span class="section-number-4">4.2.1</span> range</h4>
<div class="outline-text-4" id="text-4-2-1">
</div>
<ol class="org-ol">
<li><a id="orgc5cb0d0"></a>range(number)<br />
<div class="outline-text-5" id="text-4-2-1-1">
<p>
Returns an iterable of numbers from zero to the given number
</p>
<pre class="example" id="org79b25b8">
prints:
    0
    1
    2
    3
</pre>
<div class="org-src-container">
<pre class="src src-python">for i in range(4):
    print(i)
</pre>
</div>
</div>
</li>
