python-cheatsheet.org
**** range(lower, upper, step)
Returns an iterable of numbers
from the lower number to the upper number, while incrementing
by step. If step is not indicated, the default value is 1.
#+BEGIN_EXAMPLE
prints:
    4
    6
#+END_EXAMPLE
#+BEGIN_SRC python
for i in range(4, 8, 2):
    print(i)
#+END_SRC

** While loop
#+BEGIN_EXAMPLE
prints:
    0
    1
    2
    3
#+END_EXAMPLE
#+BEGIN_SRC python
x = 0
while x < 4:
    print(x)
    x += 1  # Shorthand for x = x + 1
#+END_SRC

** try/except - Handle exceptions
#+BEGIN_SRC python
try:
    # Use "raise" to raise an error
    raise IndexError("This is an index error")
except IndexError as e:
    pass                 # Pass is just a no-op. Usually you would do recovery here.
except (TypeError, NameError):
    pass                 # Multiple exceptions can be handled together, if required.
else:                    # Optional clause to the try/except block. Must follow all except blocks
    print("All good!")   # Runs only if the code in try raises no exceptions
finally:                 #  Execute under all circumstances
    print("We can clean up resources here")

# Instead of try/finally to cleanup resources you can use a with statement
with open("myfile.txt") as f:
    for line in f:
        print(line)
#+END_SRC

** Iterables
Python offers a fundamental abstraction called the Iterable.
An iterable is an object that can be treated as a sequence.
The object returned by the range function, is an iterable.

#+BEGIN_SRC python
filled_dict = {"one": 1, "two": 2, "three": 3}
our_iterable = filled_dict.keys()
print(our_iterable)  # => dict_keys(['one', 'two', 'three']). This is an object that implements our Iterable interface.

# We can loop over it.
for i in our_iterable:
    print(i)  # Prints one, two, three

# However we cannot address elements by index.
our_iterable[1]  # Raises a TypeError

# An iterable is an object that knows how to create an iterator.
our_iterator = iter(our_iterable)

# Our iterator is an object that can remember the state as we traverse through it.
# We get the next object with "next()".
next(our_iterator)  # => "one"

# It maintains state as we iterate.
next(our_iterator)  # => "two"
next(our_iterator)  # => "three"

# After the iterator has returned all of its data, it raises a StopIteration exception
next(our_iterator)  # Raises StopIteration

# You can grab all the elements of an iterator by calling list() on it.
list(filled_dict.keys())  # => Returns ["one", "two", "three"]
#+END_SRC

* Functions
** def - Create new functions
#+BEGIN_SRC python
def add(x, y):
    print("x is {} and y is {}".format(x, y))
    return x + y  # Return values with a return statement
    #+END_SRC

** Calling functions with parameters
#+BEGIN_SRC python
add(5, 6)  # => prints out "x is 5 and y is 6" and returns 11
#+END_SRC

** Another way to call functions
#+BEGIN_SRC python
add(y=6, x=5)  # Keyword arguments can arrive in any order.
#+END_SRC

** Arguments
*** Variable number of positional arguments
You can define functions that take a variable number of
positional arguments
#+BEGIN_SRC python
def varargs(*args):
    return args

varargs(1, 2, 3)  # => (1, 2, 3)
#+END_SRC

*** Variable number of keyword arguments
You can define functions that take a variable number of
keyword arguments, as well
#+BEGIN_SRC python
def keyword_args(**kwargs):
    return kwargs
#+END_SRC

*** Both at once
#+BEGIN_SRC python
keyword_args(big="foot", loch="ness")  # => {"big": "foot", "loch": "ness"}
# You can do both at once, if you like
def all_the_args(*args, **kwargs):
    print(args)
    print(kwargs)
"""
all_the_args(1, 2, a=3, b=4) prints:
    (1, 2)
    {"a": 3, "b": 4}
"""
#+END_SRC

*** Shorthand
When calling functions, you can do the opposite of args/kwargs!
Use * to expand tuples and use ** to expand kwargs.
#+BEGIN_SRC python
args = (1, 2, 3, 4)
kwargs = {"a": 3, "b": 4}
all_the_args(*args)            # equivalent to all_the_args(1, 2, 3, 4)
all_the_args(**kwargs)         # equivalent to all_the_args(a=3, b=4)
all_the_args(*args, **kwargs)  # equivalent to all_the_args(1, 2, 3, 4, a=3, b=4)
#+END_SRC

** Returning multiple values
Returning multiple values (with tuple assignments)
#+BEGIN_SRC python
def swap(x, y):
    return y, x  # Return multiple values as a tuple without the parenthesis.
                 # (Note: parenthesis have been excluded but can be included)
x = 1
y = 2
x, y = swap(x, y)     # => x = 2, y = 1
# (x, y) = swap(x,y)  # Again parenthesis have been excluded but can be included.
#+END_SRC

** Function Scope
#+BEGIN_SRC python
x = 5

def set_x(num):
    # Local var x not the same as global variable x
    x = num    # => 43
    print(x)   # => 43

def set_global_x(num):
    global x
    print(x)   # => 5
    x = num    # global var x is now set to 6
    print(x)   # => 6

set_x(43)
set_global_x(6)
#+END_SRC

** First class functions
Python has first class functions
#+BEGIN_SRC python
def create_adder(x):
    def adder(y):
        return x + y
    return adder

add_10 = create_adder(10)
add_10(3)   # => 13
#+END_SRC

** Anonymous functions
There are also anonymous functions
#+BEGIN_SRC python
(lambda x: x > 2)(3)                  # => True
(lambda x, y: x ** 2 + y ** 2)(2, 1)  # => 5
#+END_SRC

** Built-in higher order funcs
There are built-in higher order functions
#+BEGIN_SRC python
list(map(add_10, [1, 2, 3]))          # => [11, 12, 13]
list(map(max, [1, 2, 3], [4, 2, 1]))  # => [4, 2, 3]

list(filter(lambda x: x > 5, [3, 4, 5, 6, 7]))  # => [6, 7]
#+END_SRC

