html/python-cheatsheet.html

<li><a id="org200a02d"></a>range(lower, upper)<br />
<div class="outline-text-5" id="text-4-2-1-2">
<p>
Returns an iterable of numbers
from the lower number to the upper number
</p>
<pre class="example" id="org2c70664">
prints:
    4
    5
    6
    7
</pre>
<div class="org-src-container">
<pre class="src src-python">for i in range(4, 8):
    print(i)
</pre>
</div>
</div>
</li>

<li><a id="orgde20cfd"></a>range(lower, upper, step)<br />
<div class="outline-text-5" id="text-4-2-1-3">
<p>
Returns an iterable of numbers
from the lower number to the upper number, while incrementing
by step. If step is not indicated, the default value is 1.
</p>
<pre class="example" id="org24ce9ad">
prints:
    4
    6
</pre>
<div class="org-src-container">
<pre class="src src-python">for i in range(4, 8, 2):
    print(i)
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org177fda0" class="outline-3">
<h3 id="org177fda0"><span class="section-number-3">4.3</span> While loop</h3>
<div class="outline-text-3" id="text-4-3">
<pre class="example" id="org1f0ea51">
prints:
    0
    1
    2
    3
</pre>
<div class="org-src-container">
<pre class="src src-python">x = 0
while x &lt; 4:
    print(x)
    x += 1  # Shorthand for x = x + 1
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb6eda34" class="outline-3">
<h3 id="orgb6eda34"><span class="section-number-3">4.4</span> try/except - Handle exceptions</h3>
<div class="outline-text-3" id="text-4-4">
<div class="org-src-container">
<pre class="src src-python">try:
    # Use "raise" to raise an error
    raise IndexError("This is an index error")
except IndexError as e:
    pass                 # Pass is just a no-op. Usually you would do recovery here.
except (TypeError, NameError):
    pass                 # Multiple exceptions can be handled together, if required.
else:                    # Optional clause to the try/except block. Must follow all except blocks
    print("All good!")   # Runs only if the code in try raises no exceptions
finally:                 #  Execute under all circumstances
    print("We can clean up resources here")

# Instead of try/finally to cleanup resources you can use a with statement
with open("myfile.txt") as f:
    for line in f:
	print(line)
</pre>
</div>
</div>
</div>

<div id="outline-container-org3993878" class="outline-3">
<h3 id="org3993878"><span class="section-number-3">4.5</span> Iterables</h3>
<div class="outline-text-3" id="text-4-5">
<p>
Python offers a fundamental abstraction called the Iterable.
An iterable is an object that can be treated as a sequence.
The object returned by the range function, is an iterable.
</p>

<div class="org-src-container">
<pre class="src src-python">filled_dict = {"one": 1, "two": 2, "three": 3}
our_iterable = filled_dict.keys()
print(our_iterable)  # =&gt; dict_keys(['one', 'two', 'three']). This is an object that implements our Iterable interface.

# We can loop over it.
for i in our_iterable:
    print(i)  # Prints one, two, three

# However we cannot address elements by index.
our_iterable[1]  # Raises a TypeError

# An iterable is an object that knows how to create an iterator.
our_iterator = iter(our_iterable)

# Our iterator is an object that can remember the state as we traverse through it.
# We get the next object with "next()".
next(our_iterator)  # =&gt; "one"

# It maintains state as we iterate.
next(our_iterator)  # =&gt; "two"
next(our_iterator)  # =&gt; "three"

# After the iterator has returned all of its data, it raises a StopIteration exception
next(our_iterator)  # Raises StopIteration

# You can grab all the elements of an iterator by calling list() on it.
list(filled_dict.keys())  # =&gt; Returns ["one", "two", "three"]
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga3c9b13" class="outline-2">
<h2 id="orga3c9b13"><span class="section-number-2">5</span> Functions</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgbcc9705" class="outline-3">
<h3 id="orgbcc9705"><span class="section-number-3">5.1</span> def - Create new functions</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-python">def add(x, y):
    print("x is {} and y is {}".format(x, y))
    return x + y  # Return values with a return statement
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf3f9699" class="outline-3">
<h3 id="orgf3f9699"><span class="section-number-3">5.2</span> Calling functions with parameters</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre class="src src-python">add(5, 6)  # =&gt; prints out "x is 5 and y is 6" and returns 11
</pre>
</div>
</div>
</div>

<div id="outline-container-org0f89e1e" class="outline-3">
<h3 id="org0f89e1e"><span class="section-number-3">5.3</span> Another way to call functions</h3>
<div class="outline-text-3" id="text-5-3">
<div class="org-src-container">
<pre class="src src-python">add(y=6, x=5)  # Keyword arguments can arrive in any order.
</pre>
</div>
</div>
</div>

<div id="outline-container-org3720db0" class="outline-3">
<h3 id="org3720db0"><span class="section-number-3">5.4</span> Arguments</h3>
<div class="outline-text-3" id="text-5-4">
</div>
<div id="outline-container-org04ace81" class="outline-4">
<h4 id="org04ace81"><span class="section-number-4">5.4.1</span> Variable number of positional arguments</h4>
<div class="outline-text-4" id="text-5-4-1">
<p>
You can define functions that take a variable number of
positional arguments
</p>
<div class="org-src-container">
<pre class="src src-python">def varargs(*args):
    return args

varargs(1, 2, 3)  # =&gt; (1, 2, 3)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdb2017b" class="outline-4">
<h4 id="orgdb2017b"><span class="section-number-4">5.4.2</span> Variable number of keyword arguments</h4>
<div class="outline-text-4" id="text-5-4-2">
<p>
You can define functions that take a variable number of
keyword arguments, as well
</p>
<div class="org-src-container">
<pre class="src src-python">def keyword_args(**kwargs):
    return kwargs
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaaac3bd" class="outline-4">
<h4 id="orgaaac3bd"><span class="section-number-4">5.4.3</span> Both at once</h4>
<div class="outline-text-4" id="text-5-4-3">
<div class="org-src-container">
<pre class="src src-python">keyword_args(big="foot", loch="ness")  # =&gt; {"big": "foot", "loch": "ness"}
# You can do both at once, if you like
def all_the_args(*args, **kwargs):
    print(args)
    print(kwargs)
"""
all_the_args(1, 2, a=3, b=4) prints:
    (1, 2)
    {"a": 3, "b": 4}
"""
</pre>
</div>
</div>
</div>

<div id="outline-container-org66321ae" class="outline-4">
<h4 id="org66321ae"><span class="section-number-4">5.4.4</span> Shorthand</h4>
<div class="outline-text-4" id="text-5-4-4">
<p>
When calling functions, you can do the opposite of args/kwargs!
Use * to expand tuples and use ** to expand kwargs.
</p>
<div class="org-src-container">
<pre class="src src-python">args = (1, 2, 3, 4)
kwargs = {"a": 3, "b": 4}
all_the_args(*args)            # equivalent to all_the_args(1, 2, 3, 4)
all_the_args(**kwargs)         # equivalent to all_the_args(a=3, b=4)
all_the_args(*args, **kwargs)  # equivalent to all_the_args(1, 2, 3, 4, a=3, b=4)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb7cd2b8" class="outline-3">
<h3 id="orgb7cd2b8"><span class="section-number-3">5.5</span> Returning multiple values</h3>
<div class="outline-text-3" id="text-5-5">
<p>
Returning multiple values (with tuple assignments)
</p>
<div class="org-src-container">
<pre class="src src-python">def swap(x, y):
    return y, x  # Return multiple values as a tuple without the parenthesis.
		 # (Note: parenthesis have been excluded but can be included)
x = 1
y = 2
x, y = swap(x, y)     # =&gt; x = 2, y = 1
# (x, y) = swap(x,y)  # Again parenthesis have been excluded but can be included.
</pre>
</div>
</div>
</div>

<div id="outline-container-orgccb56b4" class="outline-3">
<h3 id="orgccb56b4"><span class="section-number-3">5.6</span> Function Scope</h3>
<div class="outline-text-3" id="text-5-6">
<div class="org-src-container">
<pre class="src src-python">x = 5

def set_x(num):
    # Local var x not the same as global variable x
    x = num    # =&gt; 43
    print(x)   # =&gt; 43

def set_global_x(num):
    global x
    print(x)   # =&gt; 5
    x = num    # global var x is now set to 6
    print(x)   # =&gt; 6

set_x(43)
set_global_x(6)
</pre>
</div>
</div>
</div>

<div id="outline-container-org44882c0" class="outline-3">
<h3 id="org44882c0"><span class="section-number-3">5.7</span> First class functions</h3>
<div class="outline-text-3" id="text-5-7">
<p>
Python has first class functions
</p>
<div class="org-src-container">
<pre class="src src-python">def create_adder(x):
    def adder(y):
	return x + y
    return adder

add_10 = create_adder(10)
add_10(3)   # =&gt; 13
</pre>
</div>
</div>
</div>

<div id="outline-container-org1dddda8" class="outline-3">
<h3 id="org1dddda8"><span class="section-number-3">5.8</span> Anonymous functions</h3>
<div class="outline-text-3" id="text-5-8">
<p>
There are also anonymous functions
</p>
<div class="org-src-container">
<pre class="src src-python">(lambda x: x &gt; 2)(3)                  # =&gt; True
(lambda x, y: x ** 2 + y ** 2)(2, 1)  # =&gt; 5
</pre>
</div>
</div>
</div>

<div id="outline-container-org03e4c2f" class="outline-3">
<h3 id="org03e4c2f"><span class="section-number-3">5.9</span> Built-in higher order funcs</h3>
<div class="outline-text-3" id="text-5-9">
<p>
There are built-in higher order functions
</p>
<div class="org-src-container">
<pre class="src src-python">list(map(add_10, [1, 2, 3]))          # =&gt; [11, 12, 13]
list(map(max, [1, 2, 3], [4, 2, 1]))  # =&gt; [4, 2, 3]

list(filter(lambda x: x &gt; 5, [3, 4, 5, 6, 7]))  # =&gt; [6, 7]
</pre>
</div>
</div>
</div>
