python-cheatsheet.org
** List comprehensions
We can use list comprehensions for nice maps and filters
List comprehension stores the output as a list which can itself be a nested list
#+BEGIN_SRC python
[add_10(i) for i in [1, 2, 3]]         # => [11, 12, 13]
[x for x in [3, 4, 5, 6, 7] if x > 5]  # => [6, 7]
#+END_SRC

** Dict comprehensions
You can construct set and dict comprehensions as well.
#+BEGIN_SRC python
{x for x in 'abcddeef' if x not in 'abc'}  # => {'d', 'e', 'f'}
{x: x**2 for x in range(5)}  # => {0: 0, 1: 1, 2: 4, 3: 9, 4: 16}
#+END_SRC

* Modules
Python modules are just ordinary Python files. You
can write your own, and import them. The name of the
module is the same as the name of the file.

If you have a Python script named math.py in the same
folder as your current script, the file math.py will
be loaded instead of the built-in Python module.
This happens because the local folder has priority
over Python's built-in libraries.

** import - Import module
You can import modules with the import keyword:
#+BEGIN_SRC python
import math
print(math.sqrt(16))  # => 4.0
#+END_SRC

** Get specific func from module#+BEGIN_SRC python from math import ceil, floor print(ceil(3.7))   # => 4.0 print(floor(3.7))  # => 3.0 #+END_SRC
** Import all funcs from module.
Warning: this is not recommended
#+BEGIN_SRC python
from math import *
#+END_SRC

** Shorten module names
#+BEGIN_SRC python
import math as m
math.sqrt(16) == m.sqrt(16)  # => True
#+END_SRC

** Find which functions and attributes are defined in a module.
#+BEGIN_SRC python
import math
dir(math)
#+END_SRC

* Classes
** Basics
Create a new Human class: (human.py)
#+BEGIN_SRC python
class Human:

    # A class attribute.
    # It is shared by all instances of this class

    species = "H. sapiens"

    # Basic initializer, this is called when this class is instantiated.

    # Note:
    #      the double leading and trailing underscores denote objects
    #      or attributes that are used by Python but that live in
    #      user-controlled namespaces.
    # ###############################################################
    # Methods(or objects or attributes) like: __init__, __str__, __repr__ etc.
    # are called special methods (or sometimes called dunder methods)
    # ###############################################################
    # You should not invent such names on your own.

    def __init__(self, name):
        # Assign the argument to the instance's name attribute
        self.name = name

        # Initialize property
        self._age = 0

    # An instance method.
    # All methods take "self" as the first argument
    def say(self, msg):
        print("{name}: {message}".format(name=self.name, message=msg))

    # Another instance method
    def sing(self):
        return 'yo... yo... microphone check... one two... one two...'

    # A class method is shared among all instances
    # They are called with the calling class as the first argument
    @classmethod
    def get_species(cls):
        return cls.species

    # A static method is called without a class or instance reference
    @staticmethod
    def grunt():
        return "*grunt*"

    # A property is just like a getter.
    # It turns the method age() into an read-only attribute of the same name.
    # There's no need to write trivial getters and setters in Python, though.
    @property
    def age(self):
        return self._age

    # This allows the property to be set
    @age.setter
    def age(self, age):
        self._age = age

    # This allows the property to be deleted
    @age.deleter
    def age(self):
        del self._age


# When a Python interpreter reads a source file it executes all its code.
#
# This __name__ check makes sure this code block is only executed when this
# module is the main program.

if __name__ == '__main__':
    # Instantiate a class
    i = Human(name="Ian")
    i.say("hi")                     # "Ian: hi"
    j = Human("Joel")
    j.say("hello")                  # "Joel: hello"
    # i and j are instances of type Human, or in other words: they are Human objects

    # Call our class method
    i.say(i.get_species())          # "Ian: H. sapiens"
    # Change the shared attribute
    Human.species = "H. neanderthalensis"
    i.say(i.get_species())          # => "Ian: H. neanderthalensis"
    j.say(j.get_species())          # => "Joel: H. neanderthalensis"

    # Call the static method
    print(Human.grunt())            # => "*grunt*"
    
    # Cannot call static method with instance of object
    # because i.grunt() will automatically put "self" (the object i) as an argument
    print(i.grunt())                # => TypeError: grunt() takes 0 positional arguments but 1 was given
                                    
    # Update the property for this instance
    i.age = 42
    # Get the property
    i.say(i.age)                    # => "Ian: 42"
    j.say(j.age)                    # => "Joel: 0"
    # Delete the property
    del i.age
    # i.age                         # => this would raise an AttributeError
#+END_SRC

** Inheritance
Inheritance allows new child classes to be defined that inherit methods and
variables from their parent class.

Using the Human class defined above as the base or parent class, we can
define a child class, Superhero, which inherits the class variables like
"species", "name", and "age", as well as methods, like "sing" and "grunt"
from the Human class, but can also have its own unique properties.

To take advantage of modularization by file you could place the classes above
in their own files, say, human.py

To import functions from other files use the following format
#+BEGIN_SRC python
from "filename-without-extension" import "function-or-class"
#+END_SRC
#+BEGIN_SRC python
from human import Human
#+END_SRC

