html/python-cheatsheet.html

<div id="outline-container-org0853e8b" class="outline-3">
<h3 id="org0853e8b"><span class="section-number-3">5.10</span> List comprehensions</h3>
<div class="outline-text-3" id="text-5-10">
<p>
We can use list comprehensions for nice maps and filters
List comprehension stores the output as a list which can itself be a nested list
</p>
<div class="org-src-container">
<pre class="src src-python">[add_10(i) for i in [1, 2, 3]]         # =&gt; [11, 12, 13]
[x for x in [3, 4, 5, 6, 7] if x &gt; 5]  # =&gt; [6, 7]
</pre>
</div>
</div>
</div>

<div id="outline-container-org995ecf1" class="outline-3">
<h3 id="org995ecf1"><span class="section-number-3">5.11</span> Dict comprehensions</h3>
<div class="outline-text-3" id="text-5-11">
<p>
You can construct set and dict comprehensions as well.
</p>
<div class="org-src-container">
<pre class="src src-python">{x for x in 'abcddeef' if x not in 'abc'}  # =&gt; {'d', 'e', 'f'}
{x: x**2 for x in range(5)}  # =&gt; {0: 0, 1: 1, 2: 4, 3: 9, 4: 16}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org82a1f8c" class="outline-2">
<h2 id="org82a1f8c"><span class="section-number-2">6</span> Modules</h2>
<div class="outline-text-2" id="text-6">
<p>
Python modules are just ordinary Python files. You
can write your own, and import them. The name of the
module is the same as the name of the file.
</p>

<p>
If you have a Python script named math.py in the same
folder as your current script, the file math.py will
be loaded instead of the built-in Python module.
This happens because the local folder has priority
over Python's built-in libraries.
</p>
</div>

<div id="outline-container-orge1d88c6" class="outline-3">
<h3 id="orge1d88c6"><span class="section-number-3">6.1</span> import - Import module</h3>
<div class="outline-text-3" id="text-6-1">
<p>
You can import modules with the import keyword:
</p>
<div class="org-src-container">
<pre class="src src-python">import math
print(math.sqrt(16))  # =&gt; 4.0
</pre>
</div>
</div>
</div>

<div id="outline-container-org670f1ec" class="outline-3">
<h3 id="org670f1ec"><span class="section-number-3">6.2</span> Get specific func from module</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">
<pre class="src src-python">from math import ceil, floor

print(ceil(3.7))   # =&gt; 4.0
print(floor(3.7))  # =&gt; 3.0
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc9a7d5b" class="outline-3">
<h3 id="orgc9a7d5b"><span class="section-number-3">6.3</span> Import all funcs from module.</h3>
<div class="outline-text-3" id="text-6-3">
<p>
Warning: this is not recommended
</p>
<div class="org-src-container">
<pre class="src src-python">from math import *
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd37d432" class="outline-3">
<h3 id="orgd37d432"><span class="section-number-3">6.4</span> Shorten module names</h3>
<div class="outline-text-3" id="text-6-4">
<div class="org-src-container">
<pre class="src src-python">import math as m
math.sqrt(16) == m.sqrt(16)  # =&gt; True
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc5d24f0" class="outline-3">
<h3 id="orgc5d24f0"><span class="section-number-3">6.5</span> Find which functions and attributes are defined in a module.</h3>
<div class="outline-text-3" id="text-6-5">
<div class="org-src-container">
<pre class="src src-python">import math
dir(math)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0a0db37" class="outline-2">
<h2 id="org0a0db37"><span class="section-number-2">7</span> Classes</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org600a181" class="outline-3">
<h3 id="org600a181"><span class="section-number-3">7.1</span> Basics</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Create a new Human class: (human.py)
</p>
<div class="org-src-container">
<pre class="src src-python">class Human:

    # A class attribute.
    # It is shared by all instances of this class

    species = "H. sapiens"

    # Basic initializer, this is called when this class is instantiated.

    # Note:
    #      the double leading and trailing underscores denote objects
    #      or attributes that are used by Python but that live in
    #      user-controlled namespaces.
    # ###############################################################
    # Methods(or objects or attributes) like: __init__, __str__, __repr__ etc.
    # are called special methods (or sometimes called dunder methods)
    # ###############################################################
    # You should not invent such names on your own.

    def __init__(self, name):
	# Assign the argument to the instance's name attribute
	self.name = name

	# Initialize property
	self._age = 0

    # An instance method.
    # All methods take "self" as the first argument
    def say(self, msg):
	print("{name}: {message}".format(name=self.name, message=msg))

    # Another instance method
    def sing(self):
	return 'yo... yo... microphone check... one two... one two...'

    # A class method is shared among all instances
    # They are called with the calling class as the first argument
    @classmethod
    def get_species(cls):
	return cls.species

    # A static method is called without a class or instance reference
    @staticmethod
    def grunt():
	return "*grunt*"

    # A property is just like a getter.
    # It turns the method age() into an read-only attribute of the same name.
    # There's no need to write trivial getters and setters in Python, though.
    @property
    def age(self):
	return self._age

    # This allows the property to be set
    @age.setter
    def age(self, age):
	self._age = age

    # This allows the property to be deleted
    @age.deleter
    def age(self):
	del self._age


# When a Python interpreter reads a source file it executes all its code.
#
# This __name__ check makes sure this code block is only executed when this
# module is the main program.

if __name__ == '__main__':
    # Instantiate a class
    i = Human(name="Ian")
    i.say("hi")                     # "Ian: hi"
    j = Human("Joel")
    j.say("hello")                  # "Joel: hello"
    # i and j are instances of type Human, or in other words: they are Human objects

    # Call our class method
    i.say(i.get_species())          # "Ian: H. sapiens"
    # Change the shared attribute
    Human.species = "H. neanderthalensis"
    i.say(i.get_species())          # =&gt; "Ian: H. neanderthalensis"
    j.say(j.get_species())          # =&gt; "Joel: H. neanderthalensis"

    # Call the static method
    print(Human.grunt())            # =&gt; "*grunt*"

    # Cannot call static method with instance of object
    # because i.grunt() will automatically put "self" (the object i) as an argument
    print(i.grunt())                # =&gt; TypeError: grunt() takes 0 positional arguments but 1 was given

    # Update the property for this instance
    i.age = 42
    # Get the property
    i.say(i.age)                    # =&gt; "Ian: 42"
    j.say(j.age)                    # =&gt; "Joel: 0"
    # Delete the property
    del i.age
    # i.age                         # =&gt; this would raise an AttributeError
</pre>
</div>
</div>
</div>

<div id="outline-container-org8c52514" class="outline-3">
<h3 id="org8c52514"><span class="section-number-3">7.2</span> Inheritance</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Inheritance allows new child classes to be defined that inherit methods and
variables from their parent class.
</p>

<p>
Using the Human class defined above as the base or parent class, we can
define a child class, Superhero, which inherits the class variables like
"species", "name", and "age", as well as methods, like "sing" and "grunt"
from the Human class, but can also have its own unique properties.
</p>

<p>
To take advantage of modularization by file you could place the classes above
in their own files, say, human.py
</p>

<p>
To import functions from other files use the following format
</p>
<div class="org-src-container">
<pre class="src src-python">from "filename-without-extension" import "function-or-class"
</pre>
</div>
<div class="org-src-container">
<pre class="src src-python">from human import Human
</pre>
</div>
</div>
