html/python-cheatsheet.html

<div id="outline-container-orgce1b29a" class="outline-4">
<h4 id="orgce1b29a"><span class="section-number-4">7.2.1</span> Inherit from the Human class (superhero.py)</h4>
<div class="outline-text-4" id="text-7-2-1">
<div class="org-src-container">
<pre class="src src-python"># Specify the parent class(es) as parameters to the class definition
class Superhero(Human):

    # If the child class should inherit all of the parent's definitions without
    # any modifications, you can just use the "pass" keyword (and nothing else)
    # but in this case it is commented out to allow for a unique child class:
    # pass

    # Child classes can override their parents' attributes
    species = 'Superhuman'

    # Children automatically inherit their parent class's constructor including
    # its arguments, but can also define additional arguments or definitions
    # and override its methods such as the class constructor.
    # This constructor inherits the "name" argument from the "Human" class and
    # adds the "superpower" and "movie" arguments:
    def __init__(self, name, movie=False,
		 superpowers=["super strength", "bulletproofing"]):

	# add additional class attributes:
	self.fictional = True
	self.movie = movie
	self.superpowers = superpowers

	# The "super" function lets you access the parent class's methods
	# that are overridden by the child, in this case, the __init__ method.
	# This calls the parent class constructor:
	super().__init__(name)

    # override the sing method
    def sing(self):
	return 'Dun, dun, DUN!'

    # add an additional instance method
    def boast(self):
	for power in self.superpowers:
	    print("I wield the power of {pow}!".format(pow=power))


if __name__ == '__main__':
    sup = Superhero(name="Tick")

    # Instance type checks
    if isinstance(sup, Human):
	print('I am human')
    if type(sup) is Superhero:
	print('I am a superhero')

    # Get the Method Resolution search Order used by both getattr() and super()
    # This attribute is dynamic and can be updated
    print(Superhero.__mro__)    # =&gt; (&lt;class '__main__.Superhero'&gt;,
				# =&gt; &lt;class 'human.Human'&gt;, &lt;class 'object'&gt;)

    # Calls parent method but uses its own class attribute
    print(sup.get_species())    # =&gt; Superhuman

    # Calls overridden method
    print(sup.sing())           # =&gt; Dun, dun, DUN!

    # Calls method from Human
    sup.say('Spoon')            # =&gt; Tick: Spoon

    # Call method that exists only in Superhero
    sup.boast()                 # =&gt; I wield the power of super strength!
				# =&gt; I wield the power of bulletproofing!

    # Inherited class attribute
    sup.age = 31
    print(sup.age)              # =&gt; 31

    # Attribute that only exists within Superhero
    print('Am I Oscar eligible? ' + str(sup.movie))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org545e58c" class="outline-3">
<h3 id="org545e58c"><span class="section-number-3">7.3</span> Multiple Inheritance</h3>
<div class="outline-text-3" id="text-7-3">
<p>
Another class example for Batman to inherit bellow (bat.py)
</p>
<div class="org-src-container">
<pre class="src src-python">class Bat:

    species = 'Baty'

    def __init__(self, can_fly=True):
	self.fly = can_fly

    # This class also has a say method
    def say(self, msg):
	msg = '... ... ...'
	return msg

    # And its own method as well
    def sonar(self):
	return '))) ... ((('

if __name__ == '__main__':
    b = Bat()
    print(b.say('hello'))
    print(b.fly)
</pre>
</div>
</div>

<div id="outline-container-org2f1250e" class="outline-4">
<h4 id="org2f1250e"><span class="section-number-4">7.3.1</span> Multiple Inheritance Example</h4>
<div class="outline-text-4" id="text-7-3-1">
<p>
The class Batman inherits from the class Human and Bat to create a Batman class.
</p>
<div class="org-src-container">
<pre class="src src-python"># And yet another class definition that inherits from Superhero and Bat
# superhero.py
from superhero import Superhero
from bat import Bat

# Define Batman as a child that inherits from both Superhero and Bat
class Batman(Superhero, Bat):

    def __init__(self, *args, **kwargs):
	# Typically to inherit attributes you have to call super:
	# super(Batman, self).__init__(*args, **kwargs)
	# However we are dealing with multiple inheritance here, and super()
	# only works with the next base class in the MRO list.
	# So instead we explicitly call __init__ for all ancestors.
	# The use of *args and **kwargs allows for a clean way to pass arguments,
	# with each parent "peeling a layer of the onion".
	Superhero.__init__(self, 'anonymous', movie=True,
			   superpowers=['Wealthy'], *args, **kwargs)
	Bat.__init__(self, *args, can_fly=False, **kwargs)
	# override the value for the name attribute
	self.name = 'Sad Affleck'

    def sing(self):
	return 'nan nan nan nan nan batman!'


if __name__ == '__main__':
    sup = Batman()

    # Get the Method Resolution search Order used by both getattr() and super().
    # This attribute is dynamic and can be updated
    print(Batman.__mro__)       # =&gt; (&lt;class '__main__.Batman'&gt;,
				# =&gt; &lt;class 'superhero.Superhero'&gt;,
				# =&gt; &lt;class 'human.Human'&gt;,
				# =&gt; &lt;class 'bat.Bat'&gt;, &lt;class 'object'&gt;)

    # Calls parent method but uses its own class attribute
    print(sup.get_species())    # =&gt; Superhuman

    # Calls overridden method
    print(sup.sing())           # =&gt; nan nan nan nan nan batman!

    # Calls method from Human, because inheritance order matters
    sup.say('I agree')          # =&gt; Sad Affleck: I agree

    # Call method that exists only in 2nd ancestor
    print(sup.sonar())          # =&gt; ))) ... (((

    # Inherited class attribute
    sup.age = 100
    print(sup.age)              # =&gt; 100

    # Inherited attribute from 2nd ancestor whose default value was overridden.
    print('Can I fly? ' + str(sup.fly)) # =&gt; Can I fly? False
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org12c9dbd" class="outline-2">
<h2 id="org12c9dbd"><span class="section-number-2">8</span> Advanced</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orga33ac09" class="outline-3">
<h3 id="orga33ac09"><span class="section-number-3">8.1</span> Generators</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Generators help you make lazy code.
</p>
<div class="org-src-container">
<pre class="src src-python">def double_numbers(iterable):
    for i in iterable:
	yield i + i
</pre>
</div>

<p>
Generators are memory-efficient because they only load the data needed to
process the next value in the iterable.
</p>

<p>
This allows them to perform operations on otherwise prohibitively large value ranges.
<span class="underline"><b>NOTE: `range` replaces `xrange` in Python 3</b></span>.
</p>
<div class="org-src-container">
<pre class="src src-python">for i in double_numbers(range(1, 900000000)):  # `range` is a generator.
    print(i)
    if i &gt;= 30:
	break
</pre>
</div>

<p>
Just as you can create a list comprehension, you can create generator
comprehensions as well.
</p>
<div class="org-src-container">
<pre class="src src-python">values = (-x for x in [1,2,3,4,5])
for x in values:
    print(x)  # prints -1 -2 -3 -4 -5 to console/terminal
</pre>
</div>

<p>
You can also cast a generator comprehension directly to a list.
</p>
<div class="org-src-container">
<pre class="src src-python">values = (-x for x in [1,2,3,4,5])
gen_to_list = list(values)
print(gen_to_list)  # =&gt; [-1, -2, -3, -4, -5]
</pre>
</div>
</div>
</div>

<div id="outline-container-org4204684" class="outline-3">
<h3 id="org4204684"><span class="section-number-3">8.2</span> Decorators</h3>
<div class="outline-text-3" id="text-8-2">
<p>
In this example `beg` wraps `say`. If <code>say_please</code> is True then it
will change the returned message.
</p>

<div class="org-src-container">
<pre class="src src-python">from functools import wraps

def beg(target_function):
    @wraps(target_function)
    def wrapper(*args, **kwargs):
	msg, say_please = target_function(*args, **kwargs)
	if say_please:
	    return "{} {}".format(msg, "Please! I am poor :(")
	return msg

    return wrapper

@beg
def say(say_please=False):
    msg = "Can you buy me a beer?"
    return msg, say_please


print(say())                 # Can you buy me a beer?
print(say(say_please=True))  # Can you buy me a beer? Please! I am poor :(
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Manos Vasilakis (advizor.gr)</p>
<p class="date">Created: 2021-09-16 Thu 22:51</p>
</div>
</body>
</html>
